{"config": {"layers": [{"config": {"ragged": false, "name": "gru_1_input", "sparse": false, "batch_input_shape": [null, 1, 7], "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "unroll": false, "activation": "tanh", "dtype": "float32", "time_major": false, "recurrent_constraint": null, "return_sequences": true, "reset_after": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.19474537762438296, "kernel_regularizer": null, "activity_regularizer": null, "name": "gru_1", "bias_constraint": null, "recurrent_regularizer": null, "implementation": 1, "units": 116, "dropout": 0.12098265767351753, "trainable": true, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "GRU"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_3", "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": [2], "momentum": 0.99, "dtype": "float32", "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"unit_forget_bias": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 0.05}, "class_name": "RandomNormal"}, "stateful": false, "unroll": false, "activation": "tanh", "dtype": "float32", "time_major": false, "recurrent_constraint": null, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.1255267749900601, "kernel_regularizer": {"config": {"l2": 0.007955257780849934, "l1": 0.0019906689412891865}, "class_name": "L1L2"}, "activity_regularizer": null, "name": "lstm_2", "bias_constraint": null, "recurrent_regularizer": null, "implementation": 1, "units": 118, "dropout": 0.05342488828342891, "trainable": true, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_4", "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": [2], "momentum": 0.99, "dtype": "float32", "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"unit_forget_bias": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "stateful": false, "unroll": false, "activation": "tanh", "dtype": "float32", "time_major": false, "recurrent_constraint": null, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "go_backwards": false, "recurrent_dropout": 0.0802321042122328, "kernel_regularizer": {"config": {"l2": 0.0022614793851971626, "l1": 0.004360675346106291}, "class_name": "L1L2"}, "activity_regularizer": null, "name": "lstm_3", "bias_constraint": null, "recurrent_regularizer": null, "implementation": 1, "units": 117, "dropout": 0.05362492206207903, "trainable": true, "recurrent_activation": "sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_5", "trainable": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": [1], "momentum": 0.99, "dtype": "float32", "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "linear", "dtype": "float32", "activity_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.4.0", "class_name": "Sequential"}