{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5-tf", "config": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "dropout": 0.24539611646490006, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.0919472017322903, "units": 500, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "bias_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "recurrent_regularizer": null, "implementation": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "activity_regularizer": null, "go_backwards": false, "return_state": false, "use_bias": true}}, "merge_mode": "concat", "batch_input_shape": [null, 1, 97], "trainable": true}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "layer": {"class_name": "LSTM", "config": {"name": "lstm_5", "dropout": 0.1317621363058945, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.17657135970227628, "units": 427, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "bias_regularizer": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "recurrent_regularizer": null, "implementation": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "activity_regularizer": null, "go_backwards": false, "return_state": false, "use_bias": true}}, "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_6", "layer": {"class_name": "LSTM", "config": {"name": "lstm_6", "dropout": 0.02012012842306656, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "trainable": true, "recurrent_dropout": 0.13562202245531454, "units": 92, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "bias_regularizer": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "recurrent_regularizer": null, "implementation": 2, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "activity_regularizer": null, "go_backwards": false, "return_state": false, "use_bias": true}}, "trainable": true, "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "epsilon": 0.001, "dtype": "float32", "center": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_constraint": null, "axis": [1], "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "units": 46, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}]}