{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf", "config": {"name": "sequential_1", "build_input_shape": [null, 3, 35], "layers": [{"class_name": "GRU", "config": {"recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "recurrent_dropout": 0.1382029766079141, "recurrent_regularizer": null, "dtype": null, "return_state": false, "name": "gru_1", "dropout": 0.04430077635894798, "return_sequences": true, "trainable": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "reset_after": false, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "units": 178, "bias_constraint": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05, "dtype": "float32"}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00650795316323638, "l1": 0.0045343078672885895}}, "implementation": 2}}, {"class_name": "SimpleRNN", "config": {"kernel_constraint": null, "recurrent_dropout": 0.09403471133665436, "recurrent_regularizer": null, "dtype": null, "return_state": false, "name": "simple_rnn_2", "dropout": 0.1855477350130658, "return_sequences": true, "trainable": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_in"}}, "activity_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "stateful": false, "units": 451, "bias_constraint": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00650795316323638, "l1": 0.0045343078672885895}}}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "momentum": 0.99, "dtype": null, "name": "batch_normalization_2", "axis": [2], "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true}}, {"class_name": "SimpleRNN", "config": {"kernel_constraint": null, "recurrent_dropout": 0.041767097045124664, "recurrent_regularizer": null, "dtype": null, "return_state": false, "name": "simple_rnn_3", "dropout": 0.19029428220806208, "return_sequences": false, "trainable": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "dtype": "float32", "seed": null, "mean": 0.0}}, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.005981241352856159, "l1": 0.006514085456728935}}, "go_backwards": false, "recurrent_constraint": null, "stateful": false, "units": 179, "bias_constraint": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.00650795316323638, "l1": 0.0045343078672885895}}}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_1", "stddev": 0.32899725423853626, "dtype": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "momentum": 0.99, "dtype": null, "name": "batch_normalization_3", "axis": [1], "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "beta_constraint": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "dtype": null, "name": "dense_1", "kernel_constraint": null, "units": 4, "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null}}]}}