{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 382, "recurrent_dropout": 0.07452018449013406, "use_bias": true, "unroll": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null, "dtype": "float32"}}, "recurrent_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.09408138772748165, "unit_forget_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "lstm_3", "bias_regularizer": null, "return_state": false, "recurrent_constraint": null, "dtype": null, "return_sequences": true, "implementation": 2, "go_backwards": false, "time_major": false, "bias_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}}}, "trainable": true, "dtype": "float32", "name": "bidirectional_3", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 212, "recurrent_dropout": 0.14827357344052822, "use_bias": true, "unroll": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "recurrent_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.17521126956732694, "unit_forget_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "lstm_4", "bias_regularizer": null, "return_state": false, "recurrent_constraint": null, "dtype": null, "return_sequences": true, "implementation": 2, "go_backwards": false, "time_major": false, "bias_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}}}, "trainable": true, "dtype": "float32", "name": "bidirectional_4", "merge_mode": "concat"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_1", "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [2], "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "center": true, "momentum": 0.99, "scale": true, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "units": 85, "recurrent_dropout": 0.18026414336657873, "use_bias": true, "unroll": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "dropout": 0.19311761205390565, "unit_forget_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "lstm_5", "bias_regularizer": null, "return_state": false, "recurrent_constraint": null, "dtype": null, "return_sequences": false, "implementation": 2, "go_backwards": false, "time_major": false, "bias_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}}}, "trainable": true, "dtype": "float32", "name": "bidirectional_5", "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "dtype": "float32", "name": "gaussian_noise_1", "stddev": 0.4160199024752531}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "units": 46}}], "name": "sequential_1", "build_input_shape": [null, 1, 105]}}