{"keras_version": "2.1.6-tf", "config": {"name": "sequential_1", "layers": [{"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "bias_constraint": null, "dtype": null, "return_sequences": true, "recurrent_dropout": 0.23000875023584588, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 2, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "go_backwards": false, "unroll": false, "return_state": false, "name": "gru_2", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "tanh", "units": 156, "recurrent_activation": "hard_sigmoid", "reset_after": false, "trainable": true, "dropout": 0.08072020422173806, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"dtype": null, "beta_constraint": null, "center": true, "name": "batch_normalization_2", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "axis": [2], "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "SimpleRNN", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "truncated_normal", "dtype": "float32", "mode": "fan_in"}}, "kernel_constraint": null, "bias_constraint": null, "return_sequences": true, "recurrent_dropout": 0.09732918314728552, "recurrent_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "go_backwards": false, "unroll": false, "dtype": null, "name": "simple_rnn_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "tanh", "units": 415, "return_state": false, "trainable": true, "dropout": 0.10030834915485735, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_1", "dtype": null, "trainable": true, "stddev": 0.4814058773445846}}, {"class_name": "BatchNormalization", "config": {"dtype": null, "beta_constraint": null, "center": true, "name": "batch_normalization_3", "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "axis": [2], "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "dtype": null, "return_sequences": false, "recurrent_dropout": 0.025907543528539988, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 2, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "go_backwards": false, "unroll": false, "return_state": false, "name": "gru_3", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "tanh", "units": 425, "recurrent_activation": "hard_sigmoid", "reset_after": false, "trainable": true, "dropout": 0.2129605589524972, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "linear", "units": 18, "dtype": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}], "build_input_shape": [null, 1, 77]}, "class_name": "Sequential", "backend": "tensorflow"}