{"keras_version": "2.4.0", "class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "ragged": false, "sparse": false, "batch_input_shape": [null, 1, 60], "name": "gru_2_input"}}, {"class_name": "GRU", "config": {"stateful": false, "dropout": 0.05031518860544475, "bias_regularizer": null, "reset_after": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "return_sequences": true, "trainable": true, "time_major": false, "kernel_initializer": {"class_name": "LecunUniform", "config": {"seed": null}}, "recurrent_dropout": 0.047493015320174796, "name": "gru_2", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "sigmoid", "units": 244, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "unroll": false, "implementation": 1, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "center": true, "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": [2], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_2"}}, {"class_name": "LSTM", "config": {"stateful": false, "unroll": false, "dropout": 0.10593754527149402, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "return_sequences": true, "trainable": true, "time_major": false, "kernel_initializer": {"class_name": "LecunUniform", "config": {"seed": null}}, "recurrent_dropout": 0.23341516613341945, "name": "lstm_1", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.006920206360518932, "l2": 0.004390625283122063}}, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "sigmoid", "units": 247, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "unit_forget_bias": true, "implementation": 1, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GRU", "config": {"stateful": false, "dropout": 0.1805885806680538, "bias_regularizer": null, "reset_after": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "return_sequences": false, "trainable": true, "time_major": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.13110959101748187, "name": "gru_3", "dtype": "float32", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.006920206360518932, "l2": 0.004390625283122063}}, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "sigmoid", "units": 432, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "unroll": false, "implementation": 1, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "center": true, "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": [1], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_3"}}, {"class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1"}}], "name": "sequential_1"}, "backend": "tensorflow"}