{"keras_version": "2.1.6-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"dropout": 0.0890062284950707, "unit_forget_bias": true, "units": 443, "activation": "tanh", "recurrent_dropout": 0.16205099220287247, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "return_state": false, "trainable": true, "bias_regularizer": null, "dtype": null, "implementation": 2, "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "name": "lstm_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "unroll": false, "activity_regularizer": null}}, "batch_input_shape": [null, 1, 97], "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"dtype": "float32", "name": "gaussian_noise_1", "stddev": 0.22053487704609054, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "trainable": true, "dtype": "float32", "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [2], "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_3"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"dropout": 0.1348452078048495, "unit_forget_bias": true, "units": 109, "activation": "tanh", "recurrent_dropout": 0.05604526205951558, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "return_state": false, "trainable": true, "bias_regularizer": null, "dtype": null, "implementation": 2, "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "name": "lstm_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "unroll": false, "activity_regularizer": null}}, "dtype": "float32", "name": "bidirectional_4", "merge_mode": "concat", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "trainable": true, "dtype": "float32", "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [2], "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_4"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"dropout": 0.11249049689092472, "unit_forget_bias": true, "units": 101, "activation": "tanh", "recurrent_dropout": 0.02595344356470295, "recurrent_constraint": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "bias_constraint": null, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "return_state": false, "trainable": true, "bias_regularizer": null, "dtype": null, "implementation": 2, "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "name": "lstm_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "unroll": false, "activity_regularizer": null}}, "dtype": "float32", "name": "bidirectional_5", "merge_mode": "concat", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "trainable": true, "dtype": "float32", "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [1], "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "momentum": 0.99, "beta_regularizer": null, "name": "batch_normalization_5"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 46, "activation": "linear", "trainable": true, "bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null}}], "name": "sequential_1"}}