{"config": [{"class_name": "Bidirectional", "config": {"dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"kernel_constraint": null, "dtype": "float32", "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "implementation": 2, "recurrent_constraint": null, "recurrent_dropout": 0.16727228146876674, "activity_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unit_forget_bias": true, "name": "lstm_4", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "units": 163, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.058126533758787374, "bias_constraint": null, "recurrent_regularizer": null, "return_sequences": true, "unroll": false, "recurrent_activation": "hard_sigmoid"}}, "batch_input_shape": [null, 1, 97], "trainable": true, "name": "bidirectional_4"}}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"kernel_constraint": null, "dtype": "float32", "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "implementation": 2, "recurrent_constraint": null, "recurrent_dropout": 0.05763961796230543, "activity_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unit_forget_bias": true, "name": "lstm_5", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "units": 107, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.14476157700987824, "bias_constraint": null, "recurrent_regularizer": null, "return_sequences": true, "unroll": false, "recurrent_activation": "hard_sigmoid"}}, "name": "bidirectional_5", "trainable": true}}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"kernel_constraint": null, "dtype": "float32", "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "implementation": 2, "recurrent_constraint": null, "recurrent_dropout": 0.24373025225782843, "activity_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "unit_forget_bias": true, "name": "lstm_6", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "units": 418, "go_backwards": false, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dropout": 0.05143829893371158, "bias_constraint": null, "recurrent_regularizer": null, "return_sequences": false, "unroll": false, "recurrent_activation": "hard_sigmoid"}}, "name": "bidirectional_6", "trainable": true}}, {"class_name": "GaussianNoise", "config": {"dtype": "float32", "stddev": 0.01422578492552248, "trainable": true, "name": "gaussian_noise_2"}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "momentum": 0.99, "center": true, "name": "batch_normalization_2", "axis": [1]}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_constraint": null, "units": 46, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_2"}}], "keras_version": "2.1.5-tf", "backend": "tensorflow", "class_name": "Sequential"}