{"config": {"build_input_shape": [null, 1, 105], "layers": [{"config": {"dtype": "float32", "name": "bidirectional_1", "layer": {"config": {"kernel_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "trainable": true, "return_state": false, "activation": "tanh", "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "time_major": false, "kernel_initializer": {"config": {"dtype": "float32", "maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "recurrent_dropout": 0.0440878667075183, "bias_regularizer": null, "unroll": false, "units": 356, "dtype": null, "recurrent_regularizer": null, "use_bias": true, "dropout": 0.2357241314324891, "bias_constraint": null, "stateful": false, "kernel_constraint": null, "name": "lstm_1", "implementation": 2, "return_sequences": true, "go_backwards": false, "activity_regularizer": null}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"kernel_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "trainable": true, "return_state": false, "reset_after": false, "activation": "tanh", "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "time_major": false, "kernel_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.03190873605877241, "bias_regularizer": null, "unroll": false, "units": 424, "dtype": "float32", "recurrent_regularizer": null, "use_bias": true, "dropout": 0.10109407758659339, "bias_constraint": null, "stateful": false, "kernel_constraint": null, "name": "gru_1", "implementation": 2, "return_sequences": true, "go_backwards": false, "activity_regularizer": null}, "class_name": "GRU"}, {"config": {"kernel_regularizer": null, "recurrent_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "return_state": false, "kernel_constraint": null, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "time_major": false, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "unroll": false, "units": 291, "recurrent_regularizer": null, "use_bias": true, "dropout": 0.18975527693088295, "recurrent_dropout": 0.1470709002933666, "bias_constraint": null, "stateful": false, "activation": "tanh", "name": "simple_rnn_1", "dtype": "float32", "return_sequences": false, "go_backwards": false, "activity_regularizer": {"config": {"l2": 0.008173467591404915, "l1": 0.009241685271263123}, "class_name": "L1L2"}}, "class_name": "SimpleRNN"}, {"config": {"epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "trainable": true, "dtype": "float32", "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [1], "scale": true, "name": "batch_normalization_1"}, "class_name": "BatchNormalization"}, {"config": {"units": 46, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "dtype": "float32", "activation": "linear", "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}