{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"batch_input_shape": [null, 1, 7], "name": "gru_3_input", "ragged": false, "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"time_major": false, "recurrent_constraint": null, "stateful": false, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "reset_after": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.1576597681463942, "unroll": false, "use_bias": true, "dropout": 0.01833699580777695, "return_state": false, "recurrent_activation": "sigmoid", "implementation": 1, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotNormal"}, "units": 83, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "name": "gru_3", "return_sequences": true}, "class_name": "GRU"}, {"config": {"time_major": false, "recurrent_constraint": null, "stateful": false, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "reset_after": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.134863090422726, "unroll": false, "use_bias": true, "dropout": 0.22062844223492392, "return_state": false, "recurrent_activation": "sigmoid", "implementation": 1, "kernel_initializer": {"config": {"seed": null}, "class_name": "LecunUniform"}, "units": 114, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "name": "gru_4", "return_sequences": true}, "class_name": "GRU"}, {"config": {"time_major": false, "recurrent_constraint": null, "stateful": false, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "reset_after": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "activation": "tanh", "recurrent_dropout": 0.06556202030208774, "unroll": false, "use_bias": true, "dropout": 0.2463212946384384, "return_state": false, "recurrent_activation": "sigmoid", "implementation": 1, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "units": 112, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "name": "gru_5", "return_sequences": false}, "class_name": "GRU"}, {"config": {"stddev": 0.17299698165987187, "name": "gaussian_noise_1", "trainable": true, "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"use_bias": true, "units": 1, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.4.0"}