{"keras_version": "2.1.6-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"activation": "tanh", "implementation": 2, "recurrent_activation": "hard_sigmoid", "units": 187, "return_sequences": true, "name": "lstm_3", "stateful": false, "unit_forget_bias": true, "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_dropout": 0.1898927552815628, "dtype": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "bias_constraint": null, "dropout": 0.07227467132770536, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0}}, "unroll": false}}, "batch_input_shape": [null, 1, 75], "trainable": true, "dtype": "float32", "name": "bidirectional_3", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"activation": "tanh", "implementation": 2, "recurrent_activation": "hard_sigmoid", "units": 240, "return_sequences": true, "name": "lstm_4", "stateful": false, "unit_forget_bias": true, "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_dropout": 0.11618666483127592, "dtype": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "bias_constraint": null, "dropout": 0.06983830912076948, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0}}, "unroll": false}}, "dtype": "float32", "name": "bidirectional_4", "merge_mode": "concat", "trainable": true}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"activation": "tanh", "implementation": 2, "recurrent_activation": "hard_sigmoid", "units": 460, "return_sequences": false, "name": "lstm_5", "stateful": false, "unit_forget_bias": true, "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "recurrent_dropout": 0.19801469838284969, "dtype": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "bias_constraint": null, "dropout": 0.23870090318881987, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0}}, "unroll": false}}, "dtype": "float32", "name": "bidirectional_5", "merge_mode": "concat", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 16, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "dtype": "float32", "seed": null, "scale": 1.0}}}}], "name": "sequential_1"}}