{"config": {"layers": [{"config": {"layer": {"config": {"recurrent_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "stateful": false, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "recurrent_dropout": 0.17880711603329655, "activity_regularizer": {"config": {"l1": 0.008214483968913555, "l2": 0.007752065546810627}, "class_name": "L1L2"}, "unroll": false, "dropout": 0.23441397625943367, "units": 230, "recurrent_regularizer": null, "name": "lstm_3", "trainable": true, "return_state": false, "dtype": null}, "class_name": "LSTM"}, "name": "bidirectional_3", "batch_input_shape": [null, 1, 67], "trainable": true, "merge_mode": "concat", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "layer": {"config": {"recurrent_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": true, "stateful": false, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "recurrent_dropout": 0.028553196149092977, "activity_regularizer": {"config": {"l1": 0.008214483968913555, "l2": 0.007752065546810627}, "class_name": "L1L2"}, "unroll": false, "dropout": 0.07030012726636342, "units": 470, "recurrent_regularizer": null, "name": "lstm_4", "trainable": true, "return_state": false, "dtype": null}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_4", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "stddev": 0.18753616415791388, "name": "gaussian_noise_1", "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "scale": true, "center": true, "axis": [2], "trainable": true, "momentum": 0.99, "name": "batch_normalization_1", "gamma_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "dtype": "float32", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "layer": {"config": {"recurrent_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_sequences": false, "stateful": false, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 2, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "recurrent_dropout": 0.10456528978893218, "activity_regularizer": {"config": {"l1": 0.008214483968913555, "l2": 0.007752065546810627}, "class_name": "L1L2"}, "unroll": false, "dropout": 0.22523880974289334, "units": 330, "recurrent_regularizer": null, "name": "lstm_5", "trainable": true, "return_state": false, "dtype": null}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_5", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "activation": "linear", "units": 16, "bias_constraint": null, "name": "dense_1", "trainable": true, "dtype": "float32", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Sequential"}