{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "build_input_shape": [null, 1, 105], "layers": [{"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "go_backwards": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "seed": null, "maxval": 0.05, "minval": -0.05}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "reset_after": false, "dtype": null, "dropout": 0.23444203162386862, "stateful": false, "units": 137, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "implementation": 2, "trainable": true, "unroll": false, "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "recurrent_dropout": 0.05792406351912492, "name": "gru_3", "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.002256226260215044, "l2": 0.008371470496058464}}, "bias_constraint": null, "activation": "tanh"}}, "trainable": true, "name": "bidirectional_3", "dtype": null, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_3", "stddev": 0.44024672076498095, "dtype": null}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "reset_after": false, "dtype": null, "dropout": 0.2233113180102309, "stateful": false, "units": 279, "kernel_regularizer": null, "return_sequences": true, "kernel_constraint": null, "implementation": 2, "trainable": true, "unroll": false, "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "recurrent_dropout": 0.2323008896687777, "name": "gru_4", "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.002256226260215044, "l2": 0.008371470496058464}}, "bias_constraint": null, "activation": "tanh"}}, "trainable": true, "name": "bidirectional_4", "dtype": null, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_4", "stddev": 0.4935135822129817, "dtype": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "axis": [2], "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "scale": true, "beta_constraint": null, "dtype": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "epsilon": 0.001, "center": true, "gamma_constraint": null}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "reset_after": false, "dtype": null, "dropout": 0.08672529870853685, "stateful": false, "units": 309, "kernel_regularizer": null, "return_sequences": false, "kernel_constraint": null, "implementation": 2, "trainable": true, "unroll": false, "activity_regularizer": null, "recurrent_constraint": null, "use_bias": true, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "recurrent_dropout": 0.01652283730304828, "name": "gru_5", "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.002256226260215044, "l2": 0.008371470496058464}}, "bias_constraint": null, "activation": "tanh"}}, "trainable": true, "name": "bidirectional_5", "dtype": null, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_5", "stddev": 0.17420581933287077, "dtype": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "dtype": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_1", "units": 46, "activation": "linear", "bias_regularizer": null}}]}, "keras_version": "2.1.6-tf"}