{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": null, "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "batch_input_shape": [null, 1, 52], "dtype": null, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 296, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.03528975322842598, "l2": 0.08443350344896317}}, "recurrent_regularizer": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.6546528339385986, "l2": 0.27173346281051636}}, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.10729488730430603, "l2": 0.09788778424263}}, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.15009916343085458, "recurrent_dropout": 0.10091273604016965, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "GaussianDropout", "config": {"name": "gaussian_dropout", "trainable": true, "dtype": null, "rate": 0.061401966278405155}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": null, "units": 192, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": null, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 1, 52]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}