{"class_name": "Sequential", "keras_version": "2.4.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "ragged": false, "name": "simple_rnn_1_input", "batch_input_shape": [null, 1, 7], "dtype": "float32"}}, {"class_name": "SimpleRNN", "config": {"time_major": false, "return_sequences": true, "kernel_initializer": {"class_name": "LecunNormal", "config": {"seed": null}}, "dtype": "float32", "recurrent_constraint": null, "kernel_regularizer": null, "go_backwards": false, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010428637033328414, "l1": 0.0004004692891612649}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "units": 99, "name": "simple_rnn_1", "recurrent_dropout": 0.05157068178690615, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.008220593445003033, "l1": 0.008499602787196636}}, "activation": "tanh", "unroll": false, "bias_constraint": null, "recurrent_regularizer": null, "use_bias": true, "return_state": false, "dropout": 0.02996450707873413}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.15619468943965553, "trainable": true, "name": "gaussian_noise_2", "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_2", "gamma_constraint": null, "dtype": "float32", "axis": [2], "scale": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "center": true}}, {"class_name": "GRU", "config": {"time_major": false, "return_sequences": true, "kernel_initializer": {"class_name": "LecunNormal", "config": {"seed": null}}, "dtype": "float32", "recurrent_constraint": null, "recurrent_activation": "sigmoid", "go_backwards": false, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010428637033328414, "l1": 0.0004004692891612649}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "units": 84, "name": "gru_2", "recurrent_dropout": 0.15688590259385132, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.008220593445003033, "l1": 0.008499602787196636}}, "activation": "tanh", "unroll": false, "reset_after": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_regularizer": null, "use_bias": true, "return_state": false, "dropout": 0.1328147287736261}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.23541933654870056, "trainable": true, "name": "gaussian_noise_3", "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_3", "gamma_constraint": null, "dtype": "float32", "axis": [2], "scale": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "center": true}}, {"class_name": "GRU", "config": {"time_major": false, "return_sequences": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "dtype": "float32", "recurrent_constraint": null, "recurrent_activation": "sigmoid", "go_backwards": false, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010428637033328414, "l1": 0.0004004692891612649}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "units": 104, "name": "gru_3", "recurrent_dropout": 0.1350087259785562, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.008220593445003033, "l1": 0.008499602787196636}}, "activation": "tanh", "unroll": false, "reset_after": true, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "recurrent_regularizer": null, "use_bias": true, "return_state": false, "dropout": 0.1287466139736448}}, {"class_name": "Dense", "config": {"trainable": true, "units": 1, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null}}], "name": "sequential_1"}, "backend": "tensorflow"}