{"keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_dropout": 0.10561785230916937, "dtype": null, "unroll": false, "kernel_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "units": 276, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "dropout": 0.1751992033789122, "return_state": false, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "time_major": false, "implementation": 2, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "return_sequences": true, "recurrent_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_3", "activity_regularizer": null, "recurrent_regularizer": null}}, "name": "bidirectional_3", "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_dropout": 0.06354512585265717, "dtype": null, "unroll": false, "kernel_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "units": 143, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "dropout": 0.09278490709286319, "return_state": false, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "time_major": false, "implementation": 2, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "return_sequences": true, "recurrent_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_4", "activity_regularizer": null, "recurrent_regularizer": null}}, "name": "bidirectional_4", "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "BatchNormalization", "config": {"axis": [2], "momentum": 0.99, "dtype": "float32", "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"recurrent_dropout": 0.15377192557162103, "dtype": null, "unroll": false, "kernel_constraint": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "units": 78, "activation": "tanh", "kernel_regularizer": null, "go_backwards": false, "dropout": 0.1158271855783186, "return_state": false, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05, "dtype": "float32"}}, "time_major": false, "implementation": 2, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "return_sequences": false, "recurrent_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "name": "lstm_5", "activity_regularizer": null, "recurrent_regularizer": null}}, "name": "bidirectional_5", "dtype": "float32", "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_1", "stddev": 0.4273400838566582, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "dtype": "float32", "bias_constraint": null, "trainable": true, "activity_regularizer": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear", "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}}}], "name": "sequential_1", "build_input_shape": [null, 1, 75]}}