{"config": [{"class_name": "Bidirectional", "config": {"batch_input_shape": [null, 1, 97], "trainable": true, "dtype": "float32", "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"go_backwards": false, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dtype": "float32", "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_dropout": 0.0637442248526188, "trainable": true, "use_bias": true, "activation": "tanh", "units": 277, "return_sequences": true, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "implementation": 2, "name": "lstm_4", "bias_constraint": null, "dropout": 0.09107457382954026}}, "name": "bidirectional_4"}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"go_backwards": false, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dtype": "float32", "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_dropout": 0.09260061970910774, "trainable": true, "use_bias": true, "activation": "tanh", "units": 453, "return_sequences": true, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "implementation": 2, "name": "lstm_5", "bias_constraint": null, "dropout": 0.012702073137247097}}, "name": "bidirectional_5", "trainable": true, "dtype": "float32"}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"go_backwards": false, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dtype": "float32", "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_dropout": 0.01311962048735596, "trainable": true, "use_bias": true, "activation": "tanh", "units": 162, "return_sequences": false, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "implementation": 2, "name": "lstm_6", "bias_constraint": null, "dropout": 0.21576856373376432}}, "name": "bidirectional_6", "trainable": true, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [1], "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "trainable": true, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "scale": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "dtype": "float32", "use_bias": true, "activation": "linear", "units": 46, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "dtype": "float32"}}}}], "backend": "tensorflow", "keras_version": "2.1.5-tf", "class_name": "Sequential"}