{"class_name": "Sequential", "keras_version": "2.2.4-tf", "config": {"name": "sequential_1", "layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"use_bias": true, "reset_after": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.1296595023341342, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "seed": null, "dtype": "float32"}}, "return_state": false, "return_sequences": true, "name": "gru_3", "trainable": true, "bias_regularizer": null, "time_major": false, "kernel_regularizer": null, "units": 170, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.22792682568755396, "kernel_constraint": null, "dtype": null, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 2, "activity_regularizer": null, "activation": "tanh"}}, "trainable": true, "dtype": "float32"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"use_bias": true, "reset_after": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.027762713161474967, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "return_state": false, "return_sequences": true, "name": "gru_4", "trainable": true, "bias_regularizer": null, "time_major": false, "kernel_regularizer": null, "units": 440, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.14379016619454088, "kernel_constraint": null, "dtype": null, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 2, "activity_regularizer": null, "activation": "tanh"}}, "trainable": true, "dtype": "float32"}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_1", "stddev": 0.3520821567576723, "trainable": true, "dtype": "float32"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"use_bias": true, "reset_after": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "dropout": 0.20982317294120573, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_state": false, "return_sequences": false, "name": "gru_5", "trainable": true, "bias_regularizer": null, "time_major": false, "kernel_regularizer": null, "units": 153, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.040349498691962415, "kernel_constraint": null, "dtype": null, "recurrent_constraint": null, "recurrent_regularizer": null, "implementation": 2, "activity_regularizer": null, "activation": "tanh"}}, "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "bias_regularizer": null, "units": 46, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear"}}], "build_input_shape": [null, 1, 105]}, "backend": "tensorflow"}