{"config": {"name": "sequential_1", "layers": [{"config": {"implementation": 2, "name": "gru_2", "recurrent_dropout": 0.2291408517368172, "kernel_initializer": {"config": {"minval": -0.05, "seed": null, "dtype": "float32", "maxval": 0.05}, "class_name": "RandomUniform"}, "kernel_constraint": null, "return_sequences": true, "go_backwards": false, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "dropout": 0.17152778835957855, "units": 395, "recurrent_activation": "hard_sigmoid", "return_state": false, "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "use_bias": true, "dtype": null, "activation": "tanh", "kernel_regularizer": null, "reset_after": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_constraint": null, "stateful": false}, "class_name": "GRU"}, {"config": {"dtype": null, "stddev": 0.22509440070777698, "trainable": true, "name": "gaussian_noise_3"}, "class_name": "GaussianNoise"}, {"config": {"layer": {"config": {"implementation": 2, "name": "gru_3", "recurrent_dropout": 0.23874175934107994, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 1.0, "distribution": "truncated_normal", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "return_sequences": true, "go_backwards": false, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "dropout": 0.07529566436077913, "units": 129, "recurrent_activation": "hard_sigmoid", "return_state": false, "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "use_bias": true, "dtype": null, "activation": "tanh", "kernel_regularizer": null, "reset_after": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_constraint": null, "stateful": false}, "class_name": "GRU"}, "dtype": null, "trainable": true, "name": "bidirectional_2", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"dtype": null, "stddev": 0.41307118622252487, "trainable": true, "name": "gaussian_noise_4"}, "class_name": "GaussianNoise"}, {"config": {"layer": {"config": {"name": "simple_rnn_1", "recurrent_dropout": 0.12655007694536605, "kernel_initializer": {"config": {"minval": -0.05, "seed": null, "dtype": "float32", "maxval": 0.05}, "class_name": "RandomUniform"}, "kernel_constraint": null, "return_sequences": false, "go_backwards": false, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "dropout": 0.13803119948102138, "units": 460, "use_bias": true, "return_state": false, "bias_regularizer": null, "unroll": false, "activity_regularizer": null, "dtype": null, "activation": "tanh", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_constraint": null, "stateful": false}, "class_name": "SimpleRNN"}, "dtype": null, "trainable": true, "name": "bidirectional_3", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"dtype": null, "stddev": 0.14161748429826668, "trainable": true, "name": "gaussian_noise_5"}, "class_name": "GaussianNoise"}, {"config": {"scale": true, "name": "batch_normalization_1", "epsilon": 0.001, "center": true, "dtype": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "axis": [1]}, "class_name": "BatchNormalization"}, {"config": {"bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "dtype": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "units": 46, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "build_input_shape": [null, 1, 105]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf"}