{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Bidirectional", "config": {"trainable": true, "batch_input_shape": [null, 1, 97], "layer": {"class_name": "LSTM", "config": {"implementation": 2, "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "bias_regularizer": null, "return_sequences": true, "use_bias": true, "units": 465, "unroll": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.08224678047599633, "trainable": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}}, "return_state": false, "recurrent_dropout": 0.13586729659351962, "activation": "tanh", "name": "lstm_4"}}, "dtype": "float32", "name": "bidirectional_4", "merge_mode": "concat"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "axis": [2], "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "dtype": "float32", "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_3"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_5", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"implementation": 2, "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "bias_regularizer": null, "return_sequences": true, "use_bias": true, "units": 187, "unroll": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.1483748821175908, "trainable": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}}, "return_state": false, "recurrent_dropout": 0.04789637730784932, "activation": "tanh", "name": "lstm_5"}}, "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "name": "bidirectional_6", "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"implementation": 2, "activity_regularizer": null, "bias_constraint": null, "go_backwards": false, "bias_regularizer": null, "return_sequences": false, "use_bias": true, "units": 329, "unroll": false, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.13086804909463906, "trainable": true, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}}, "return_state": false, "recurrent_dropout": 0.11750350906800527, "activation": "tanh", "name": "lstm_6"}}, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_2", "dtype": "float32", "stddev": 0.603974098997224}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "axis": [1], "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "dtype": "float32", "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "scale": true, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_4"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "dtype": "float32", "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "kernel_regularizer": null, "units": 46, "kernel_constraint": null, "activation": "linear", "name": "dense_2"}}], "keras_version": "2.1.5-tf"}