{"keras_version": "2.1.6-tf", "config": {"layers": [{"config": {"name": "bidirectional_3", "merge_mode": "concat", "batch_input_shape": [null, 1, 55], "trainable": true, "layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "trainable": true, "kernel_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "use_bias": true, "name": "lstm_3", "go_backwards": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "return_state": false, "activity_regularizer": null, "dropout": 0.15148217046600757, "recurrent_regularizer": null, "unroll": false, "implementation": 2, "bias_regularizer": null, "stateful": false, "units": 270, "dtype": null, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.23724773491152884, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "LSTM"}, "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "gaussian_noise_2", "stddev": 0.4063143286865464, "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"trainable": true, "name": "bidirectional_4", "merge_mode": "concat", "layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "trainable": true, "kernel_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "use_bias": true, "name": "lstm_4", "go_backwards": false, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "return_state": false, "activity_regularizer": null, "dropout": 0.15389160606617408, "recurrent_regularizer": null, "unroll": false, "implementation": 2, "bias_regularizer": null, "stateful": false, "units": 171, "dtype": null, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.2445993570364068, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "LSTM"}, "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"momentum": 0.99, "beta_regularizer": null, "trainable": true, "center": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "scale": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "name": "batch_normalization_1", "axis": [2], "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "bidirectional_5", "merge_mode": "concat", "layer": {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "trainable": true, "kernel_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "use_bias": true, "name": "lstm_5", "go_backwards": false, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "activity_regularizer": null, "dropout": 0.23587101198774413, "recurrent_regularizer": null, "unroll": false, "implementation": 2, "bias_regularizer": {"config": {"l2": 0.007039936725050211, "l1": 0.0049066850915551186}, "class_name": "L1L2"}, "stateful": false, "units": 321, "dtype": null, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.10413576824068581, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "LSTM"}, "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "gaussian_noise_3", "stddev": 0.5494888846050116, "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"trainable": true, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "units": 4, "dtype": "float32", "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential"}