{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5-tf", "config": [{"class_name": "Bidirectional", "config": {"trainable": true, "batch_input_shape": [null, 1, 97], "layer": {"class_name": "LSTM", "config": {"go_backwards": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0035133473575115204, "l2": 0.004287354648113251}}, "bias_regularizer": null, "name": "lstm_4", "dropout": 0.19842424609128176, "recurrent_dropout": 0.08482140552122445, "kernel_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "implementation": 2, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 376, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}}, "kernel_regularizer": null, "return_sequences": true, "unroll": false}}, "merge_mode": "concat", "dtype": "float32", "name": "bidirectional_4"}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussian_noise_2", "dtype": "float32", "stddev": 0.2950411338833638}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"go_backwards": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0035133473575115204, "l2": 0.004287354648113251}}, "bias_regularizer": null, "name": "lstm_5", "dropout": 0.019693117868844263, "recurrent_dropout": 0.07048698093715935, "kernel_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "implementation": 2, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 310, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}}, "kernel_regularizer": null, "return_sequences": true, "unroll": false}}, "merge_mode": "concat", "dtype": "float32", "name": "bidirectional_5"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"go_backwards": false, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "recurrent_regularizer": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0035133473575115204, "l2": 0.004287354648113251}}, "bias_regularizer": null, "name": "lstm_6", "dropout": 0.15870279636121137, "recurrent_dropout": 0.21363279215545355, "kernel_constraint": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "recurrent_constraint": null, "bias_constraint": null, "use_bias": true, "implementation": 2, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 206, "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}}, "kernel_regularizer": null, "return_sequences": false, "unroll": false}}, "merge_mode": "concat", "dtype": "float32", "name": "bidirectional_6"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "center": true, "axis": [1], "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": "float32", "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "units": 46, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}]}