{"config": {"build_input_shape": [null, 1, 75], "name": "sequential_1", "layers": [{"config": {"bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "dtype": "float32", "stddev": 0.05}, "class_name": "TruncatedNormal"}, "use_bias": true, "trainable": true, "activation": "tanh", "return_sequences": true, "units": 176, "activity_regularizer": null, "name": "simple_rnn_3", "dropout": 0.07819418009166453, "return_state": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "stateful": false, "dtype": null, "unroll": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.03424840570235489}, "class_name": "SimpleRNN"}, {"config": {"momentum": 0.99, "beta_constraint": null, "name": "batch_normalization_2", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "center": true, "axis": [2], "gamma_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null, "dtype": "float32"}, "class_name": "RandomUniform"}, "use_bias": true, "trainable": true, "activation": "tanh", "return_sequences": true, "units": 281, "activity_regularizer": null, "name": "simple_rnn_4", "dropout": 0.04914922138821553, "return_state": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "stateful": false, "dtype": null, "unroll": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.17652941601070157}, "class_name": "SimpleRNN"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "uniform", "scale": 2.0, "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "activation": "tanh", "return_sequences": false, "units": 393, "activity_regularizer": null, "name": "simple_rnn_5", "dropout": 0.06437228920605595, "return_state": false, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "stateful": false, "dtype": null, "unroll": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.13335301218057893}, "class_name": "SimpleRNN"}, {"config": {"dtype": null, "name": "gaussian_noise_1", "trainable": true, "stddev": 0.40807728243849284}, "class_name": "GaussianNoise"}, {"config": {"momentum": 0.99, "beta_constraint": null, "name": "batch_normalization_3", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "center": true, "axis": [1], "gamma_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"units": 16, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}]}, "keras_version": "2.1.6-tf", "class_name": "Sequential", "backend": "tensorflow"}