{"keras_version": "2.2.4-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"build_input_shape": [null, 1, 75], "name": "sequential_1", "layers": [{"class_name": "Bidirectional", "config": {"layer": {"class_name": "SimpleRNN", "config": {"return_state": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "dtype": "float32", "maxval": 0.05}}, "stateful": false, "return_sequences": true, "zero_output_for_mask": true, "unroll": false, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0027781357057392597, "l1": 0.0014166072942316532}}, "activation": "tanh", "dtype": null, "units": 503, "name": "simple_rnn_3", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.10567518526519484, "time_major": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "dropout": 0.2173286894551965, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "go_backwards": false, "bias_constraint": null}}, "name": "bidirectional_3", "merge_mode": "concat", "trainable": true, "dtype": "float32"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "SimpleRNN", "config": {"return_state": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "stateful": false, "return_sequences": true, "zero_output_for_mask": true, "unroll": false, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0027781357057392597, "l1": 0.0014166072942316532}}, "activation": "tanh", "dtype": null, "units": 245, "name": "simple_rnn_4", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.10593383100043106, "time_major": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "dropout": 0.021625575071933523, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "go_backwards": false, "bias_constraint": null}}, "name": "bidirectional_4", "merge_mode": "concat", "trainable": true, "dtype": "float32"}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "SimpleRNN", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "truncated_normal", "mode": "fan_in", "dtype": "float32"}}, "stateful": false, "return_sequences": false, "zero_output_for_mask": true, "unroll": false, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0027781357057392597, "l1": 0.0014166072942316532}}, "activation": "tanh", "dtype": null, "units": 180, "name": "simple_rnn_5", "trainable": true, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.07428835505026521, "time_major": false, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "dropout": 0.01570386812985132, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "go_backwards": false, "bias_constraint": null}}, "name": "bidirectional_5", "merge_mode": "concat", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activity_regularizer": null, "activation": "linear", "dtype": "float32", "units": 16, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}}]}}