{"keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"layers": [{"config": {"trainable": true, "merge_mode": "concat", "dtype": "float32", "layer": {"config": {"unroll": false, "kernel_constraint": null, "stateful": false, "activity_regularizer": null, "dtype": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.19530168789420577, "kernel_regularizer": null, "trainable": true, "return_sequences": true, "implementation": 2, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 380, "name": "lstm_3", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dropout": 0.19584713236684134, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true}, "class_name": "LSTM"}, "name": "bidirectional_3", "batch_input_shape": [null, 1, 67]}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "gaussian_noise_2", "stddev": 0.04837649355932339, "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"trainable": true, "layer": {"config": {"unroll": false, "kernel_constraint": null, "stateful": false, "activity_regularizer": null, "dtype": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.15080932195717536, "kernel_regularizer": null, "trainable": true, "return_sequences": true, "implementation": 2, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 355, "name": "lstm_4", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dropout": 0.22362791231892135, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_4", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "layer": {"config": {"unroll": false, "kernel_constraint": null, "stateful": false, "activity_regularizer": null, "dtype": null, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.15191675529873716, "kernel_regularizer": null, "trainable": true, "return_sequences": false, "implementation": 2, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 225, "name": "lstm_5", "recurrent_constraint": null, "go_backwards": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dropout": 0.19937270166020213, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "use_bias": true, "bias_regularizer": null, "unit_forget_bias": true}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_5", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "gaussian_noise_3", "stddev": 0.05066292556195941, "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0, "dtype": "float32"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 16, "use_bias": true, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}