{"keras_version": "2.4.0", "backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "ragged": false, "batch_input_shape": [null, 1, 7], "sparse": false, "name": "gru_2_input"}, "class_name": "InputLayer"}, {"config": {"return_state": false, "recurrent_regularizer": null, "activation": "tanh", "go_backwards": false, "implementation": 1, "activity_regularizer": {"config": {"l1": 0.0016883632633835077, "l2": 0.0018120090244337916}, "class_name": "L1L2"}, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_initializer": {"config": {"seed": null}, "class_name": "HeUniform"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "dropout": 0.011467704162790582, "trainable": true, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "time_major": false, "reset_after": true, "name": "gru_2", "units": 125, "dtype": "float32", "recurrent_constraint": null, "recurrent_dropout": 0.0930419613709336, "use_bias": true}, "class_name": "GRU"}, {"config": {"dtype": "float32", "trainable": true, "stddev": 0.33216665136113016, "name": "gaussian_noise_1"}, "class_name": "GaussianNoise"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "batch_normalization_2", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "axis": [2], "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"return_state": false, "recurrent_regularizer": null, "activation": "tanh", "go_backwards": false, "implementation": 1, "activity_regularizer": {"config": {"l1": 0.0016883632633835077, "l2": 0.0018120090244337916}, "class_name": "L1L2"}, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "dropout": 0.18152827946727634, "trainable": true, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "time_major": false, "reset_after": true, "name": "gru_3", "units": 126, "dtype": "float32", "recurrent_constraint": null, "recurrent_dropout": 0.0726885806651251, "use_bias": true}, "class_name": "GRU"}, {"config": {"epsilon": 0.001, "momentum": 0.99, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "center": true, "axis": [2], "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"recurrent_regularizer": null, "activation": "tanh", "unit_forget_bias": true, "implementation": 1, "activity_regularizer": {"config": {"l1": 0.005048847757279873, "l2": 0.005346192512661219}, "class_name": "L1L2"}, "return_sequences": false, "go_backwards": false, "unroll": false, "kernel_initializer": {"config": {"seed": null, "stddev": 0.05, "mean": 0.0}, "class_name": "TruncatedNormal"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "dropout": 0.014103649133995186, "trainable": true, "recurrent_activation": "sigmoid", "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "stateful": false, "time_major": false, "return_state": false, "name": "lstm_1", "units": 124, "dtype": "float32", "recurrent_constraint": null, "recurrent_dropout": 0.21748607254545144, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}