{"keras_version": "2.1.6-tf", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "build_input_shape": [null, 1, 105], "layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "layer": {"class_name": "GRU", "config": {"implementation": 2, "kernel_regularizer": null, "stateful": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_sequences": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "trainable": true, "recurrent_regularizer": null, "dtype": null, "dropout": 0.23444203162386862, "reset_after": false, "use_bias": true, "bias_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.05792406351912492, "return_state": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "units": 137, "name": "gru_3", "kernel_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "minval": -0.05, "seed": null, "maxval": 0.05}}}}, "merge_mode": "concat", "dtype": null}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_3", "stddev": 0.44024672076498095, "trainable": true, "dtype": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "layer": {"class_name": "GRU", "config": {"implementation": 2, "kernel_regularizer": null, "stateful": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_sequences": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "trainable": true, "recurrent_regularizer": null, "dtype": null, "dropout": 0.2233113180102309, "reset_after": false, "use_bias": true, "bias_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.2323008896687777, "return_state": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "units": 279, "name": "gru_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}}}, "merge_mode": "concat", "dtype": null}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_4", "stddev": 0.4935135822129817, "trainable": true, "dtype": null}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "momentum": 0.99, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "dtype": null, "beta_constraint": null, "name": "batch_normalization_1", "axis": [2], "gamma_constraint": null, "beta_regularizer": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "layer": {"class_name": "GRU", "config": {"implementation": 2, "kernel_regularizer": null, "stateful": false, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "return_sequences": false, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "trainable": true, "recurrent_regularizer": null, "dtype": null, "dropout": 0.08672529870853685, "reset_after": false, "use_bias": true, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.006229593884199858, "l2": 0.008352039381861687}}, "activation": "tanh", "recurrent_dropout": 0.01652283730304828, "return_state": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "units": 309, "name": "gru_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}}}, "merge_mode": "concat", "dtype": null}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_5", "stddev": 0.17420581933287077, "trainable": true, "dtype": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "units": 46, "trainable": true, "dtype": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "use_bias": true}}]}}