{"keras_version": "2.1.6-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "SimpleRNN", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "dtype": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 98, "recurrent_regularizer": null, "name": "simple_rnn_3", "return_sequences": true, "recurrent_dropout": 0.030219999281019788, "activation": "tanh", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "activity_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "stateful": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "dtype": "float32", "stddev": 0.05, "mean": 0.0}}, "dropout": 0.09691719155154134}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [2], "center": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_1", "gamma_regularizer": null, "scale": true, "epsilon": 0.001}}, {"class_name": "SimpleRNN", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "dtype": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 429, "recurrent_regularizer": null, "name": "simple_rnn_4", "return_sequences": true, "recurrent_dropout": 0.027182643009911134, "activation": "tanh", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "activity_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "stateful": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "dtype": "float32", "distribution": "truncated_normal", "scale": 1.0}}, "dropout": 0.13726258489025658}}, {"class_name": "SimpleRNN", "config": {"use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "dtype": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 440, "recurrent_regularizer": null, "name": "simple_rnn_5", "return_sequences": false, "recurrent_dropout": 0.10654318132762208, "activation": "tanh", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "activity_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "trainable": true, "stateful": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "dtype": "float32", "distribution": "truncated_normal", "scale": 1.0}}, "dropout": 0.18601293617741663}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_1", "stddev": 0.17242087725736316, "trainable": true, "dtype": null}}, {"class_name": "Dense", "config": {"units": 16, "dtype": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear", "trainable": true, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null}}], "name": "sequential_1", "build_input_shape": [null, 1, 75]}}