{"config": {"layers": [{"config": {"name": "bidirectional_3", "layer": {"config": {"activation": "tanh", "name": "lstm_3", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_constraint": null, "trainable": true, "dtype": null, "recurrent_constraint": null, "units": 481, "implementation": 2, "unroll": false, "go_backwards": false, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_regularizer": {"config": {"l1": 0.0030299576465040445, "l2": 0.0017001976957544684}, "class_name": "L1L2"}, "use_bias": true, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_dropout": 0.09909777113468873, "kernel_constraint": null, "dropout": 0.12313322240247002}, "class_name": "LSTM"}, "trainable": true, "batch_input_shape": [null, 1, 67], "merge_mode": "concat", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_4", "layer": {"config": {"activation": "tanh", "name": "lstm_4", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_constraint": null, "trainable": true, "dtype": null, "recurrent_constraint": null, "units": 276, "implementation": 2, "unroll": false, "go_backwards": false, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_regularizer": {"config": {"l1": 0.0030299576465040445, "l2": 0.0017001976957544684}, "class_name": "L1L2"}, "use_bias": true, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_dropout": 0.16698450453313748, "kernel_constraint": null, "dropout": 0.20533593127076594}, "class_name": "LSTM"}, "dtype": "float32", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "gaussian_noise_1", "dtype": "float32", "stddev": 0.02594633948126585}, "class_name": "GaussianNoise"}, {"config": {"trainable": true, "name": "bidirectional_5", "layer": {"config": {"activation": "tanh", "name": "lstm_5", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "unit_forget_bias": true, "bias_constraint": null, "trainable": true, "dtype": null, "recurrent_constraint": null, "units": 335, "implementation": 2, "unroll": false, "go_backwards": false, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_regularizer": {"config": {"l1": 0.0030299576465040445, "l2": 0.0017001976957544684}, "class_name": "L1L2"}, "use_bias": true, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_dropout": 0.22250475040349854, "kernel_constraint": null, "dropout": 0.2269024483866182}, "class_name": "LSTM"}, "dtype": "float32", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"momentum": 0.99, "name": "batch_normalization_1", "gamma_regularizer": null, "axis": [1], "trainable": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "scale": true, "beta_regularizer": null, "center": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "name": "dense_1", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 16, "dtype": "float32", "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6-tf"}