{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Bidirectional", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 55], "layer": {"class_name": "LSTM", "config": {"activity_regularizer": null, "return_sequences": true, "units": 405, "unroll": false, "kernel_constraint": null, "recurrent_dropout": 0.125721326960194, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "implementation": 2, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "use_bias": true, "name": "lstm_3", "dropout": 0.03417960635947817, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "bias_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "activation": "tanh"}}, "name": "bidirectional_3", "trainable": true, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"dtype": "float32", "name": "gaussian_noise_2", "trainable": true, "stddev": 0.4093946353104184}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "axis": [2], "trainable": true, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "name": "bidirectional_4", "trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"activity_regularizer": null, "return_sequences": true, "units": 72, "unroll": false, "kernel_constraint": null, "recurrent_dropout": 0.06359465646423301, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "implementation": 2, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "use_bias": true, "name": "lstm_4", "dropout": 0.17099006289562887, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "bias_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "activation": "tanh"}}}}, {"class_name": "GaussianNoise", "config": {"dtype": "float32", "name": "gaussian_noise_3", "trainable": true, "stddev": 0.4429143616629255}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "axis": [2], "trainable": true, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "name": "bidirectional_5", "trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"activity_regularizer": null, "return_sequences": false, "units": 173, "unroll": false, "kernel_constraint": null, "recurrent_dropout": 0.12199699906532052, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "implementation": 2, "trainable": true, "bias_constraint": null, "unit_forget_bias": true, "use_bias": true, "name": "lstm_5", "dropout": 0.1892525890587151, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "bias_regularizer": null, "recurrent_regularizer": null, "go_backwards": false, "activation": "tanh"}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "dtype": "float32", "units": 4, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "activation": "linear"}}], "name": "sequential_1"}, "keras_version": "2.1.6-tf"}