{"class_name": "Sequential", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "dtype": "float32", "trainable": true, "merge_mode": "concat", "batch_input_shape": [null, 1, 52], "layer": {"class_name": "LSTM", "config": {"dtype": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "units": 340, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_constraint": null, "name": "lstm_3", "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "unit_forget_bias": true, "recurrent_dropout": 0.17545891490658236, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009702711366117, "l1": 0.0012052374659106135}}, "kernel_regularizer": null, "kernel_constraint": null, "return_state": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.22044616256304025, "recurrent_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "activation": "tanh"}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "dtype": "float32", "trainable": true, "layer": {"class_name": "LSTM", "config": {"dtype": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "units": 172, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_constraint": null, "name": "lstm_4", "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "unit_forget_bias": true, "recurrent_dropout": 0.12506263520159402, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009702711366117, "l1": 0.0012052374659106135}}, "kernel_regularizer": null, "kernel_constraint": null, "return_state": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.061815274010077734, "recurrent_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "activation": "tanh"}}, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_2", "dtype": "float32", "trainable": true, "stddev": 0.1840079785533233}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "dtype": "float32", "trainable": true, "layer": {"class_name": "LSTM", "config": {"dtype": null, "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "units": 145, "implementation": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_constraint": null, "name": "lstm_5", "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "unit_forget_bias": true, "recurrent_dropout": 0.0887815741789763, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.007852018810808659, "l1": 0.005439685191959143}}, "kernel_regularizer": null, "kernel_constraint": null, "return_state": false, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.15648519811496459, "recurrent_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "activation": "tanh"}}, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_3", "dtype": "float32", "trainable": true, "stddev": 0.1343777719379121}}, {"class_name": "Dense", "config": {"dtype": "float32", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "name": "dense_1", "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null}}]}}