{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"build_input_shape": [null, 1, 105], "layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "implementation": 2, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.1191336982298825, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "trainable": true, "dropout": 0.14605991624196193, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "return_sequences": true, "name": "gru_3", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "stateful": false, "units": 361, "reset_after": false, "go_backwards": false, "activation": "tanh", "time_major": false, "unroll": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}}}, "dtype": "float32"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "implementation": 2, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.09837507167531859, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "trainable": true, "dropout": 0.022811566787303034, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "return_sequences": true, "name": "gru_4", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "stateful": false, "units": 133, "reset_after": false, "go_backwards": false, "activation": "tanh", "time_major": false, "unroll": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}}}, "dtype": "float32"}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "implementation": 2, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_dropout": 0.04402209631213776, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.006368829868733883, "l1": 0.008784772828221321}}, "trainable": true, "dropout": 0.11849535391092733, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "return_sequences": false, "name": "gru_5", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "stateful": false, "units": 258, "reset_after": false, "go_backwards": false, "activation": "tanh", "time_major": false, "unroll": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}}}, "dtype": "float32"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "units": 46, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "activation": "linear", "name": "dense_1"}}], "name": "sequential_1"}}