{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"build_input_shape": [null, 1, 105], "name": "sequential_1", "layers": [{"config": {"dtype": "float32", "layer": {"config": {"unroll": false, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "time_major": false, "kernel_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_regularizer": null, "bias_constraint": null, "return_state": false, "stateful": false, "implementation": 2, "name": "lstm_3", "recurrent_dropout": 0.03539766935646814, "dtype": null, "dropout": 0.158665163184572, "units": 474, "activation": "tanh", "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_3", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"dtype": "float32", "stddev": 0.35274584086566846, "trainable": true, "name": "gaussian_noise_2"}, "class_name": "GaussianNoise"}, {"config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [2], "name": "batch_normalization_3", "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "dtype": "float32", "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "layer": {"config": {"unroll": false, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "return_sequences": true, "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "time_major": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null, "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_regularizer": null, "bias_constraint": null, "return_state": false, "stateful": false, "implementation": 2, "name": "lstm_4", "recurrent_dropout": 0.04148755744993142, "dtype": null, "dropout": 0.09301117944636902, "units": 277, "activation": "tanh", "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_4", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"dtype": "float32", "stddev": 0.21078343189223137, "trainable": true, "name": "gaussian_noise_3"}, "class_name": "GaussianNoise"}, {"config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [2], "name": "batch_normalization_4", "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "dtype": "float32", "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "layer": {"config": {"unroll": false, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "return_sequences": false, "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "time_major": false, "kernel_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_regularizer": null, "bias_constraint": null, "return_state": false, "stateful": false, "implementation": 2, "name": "lstm_5", "recurrent_dropout": 0.18134216322237745, "dtype": null, "dropout": 0.23914419508596574, "units": 473, "activation": "tanh", "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true, "name": "bidirectional_5", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "axis": [1], "name": "batch_normalization_5", "gamma_constraint": null, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "epsilon": 0.001, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "center": true, "beta_constraint": null, "dtype": "float32", "scale": true, "momentum": 0.99, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "units": 46, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "activation": "linear"}, "class_name": "Dense"}]}, "class_name": "Sequential"}