{"class_name": "Sequential", "backend": "tensorflow", "config": {"build_input_shape": [null, 1, 60], "layers": [{"class_name": "Bidirectional", "config": {"trainable": true, "dtype": "float32", "merge_mode": "concat", "name": "bidirectional_3", "layer": {"class_name": "GRU", "config": {"recurrent_dropout": 0.21014105450396725, "dropout": 0.04331265935958987, "use_bias": true, "dtype": null, "return_state": false, "return_sequences": true, "name": "gru_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "maxval": 0.05, "seed": null, "minval": -0.05}}, "stateful": false, "recurrent_regularizer": null, "trainable": true, "reset_after": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "time_major": false, "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 77, "unroll": false, "recurrent_activation": "hard_sigmoid", "implementation": 2, "bias_constraint": null, "kernel_constraint": null}}}}, {"class_name": "Bidirectional", "config": {"trainable": true, "dtype": "float32", "merge_mode": "concat", "name": "bidirectional_4", "layer": {"class_name": "LSTM", "config": {"recurrent_dropout": 0.09656652866355332, "unit_forget_bias": true, "dropout": 0.07906933843210145, "use_bias": true, "dtype": null, "return_state": false, "return_sequences": true, "name": "lstm_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "recurrent_regularizer": null, "trainable": true, "activity_regularizer": null, "go_backwards": false, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "time_major": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 170, "unroll": false, "recurrent_activation": "hard_sigmoid", "implementation": 2, "bias_constraint": null, "kernel_constraint": null}}}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "center": true, "dtype": "float32", "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "axis": [2], "beta_constraint": null, "trainable": true, "beta_regularizer": null, "name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Bidirectional", "config": {"trainable": true, "dtype": "float32", "merge_mode": "concat", "name": "bidirectional_5", "layer": {"class_name": "GRU", "config": {"recurrent_dropout": 0.16423028479569118, "dropout": 0.20491911712454985, "use_bias": true, "dtype": null, "return_state": false, "return_sequences": false, "name": "gru_3", "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"dtype": "float32", "seed": null, "stddev": 0.05, "mean": 0.0}}, "stateful": false, "recurrent_regularizer": null, "trainable": true, "reset_after": false, "go_backwards": false, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "time_major": false, "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 432, "unroll": false, "recurrent_activation": "hard_sigmoid", "implementation": 2, "bias_constraint": null, "kernel_constraint": null}}}}, {"class_name": "GaussianNoise", "config": {"trainable": true, "dtype": "float32", "name": "gaussian_noise_1", "stddev": 0.449716730237106}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "use_bias": true, "dtype": "float32", "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1, "trainable": true, "activity_regularizer": null, "kernel_constraint": null}}], "name": "sequential_1"}, "keras_version": "2.2.4-tf"}