{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "build_input_shape": [null, 1, 75], "layers": [{"class_name": "LSTM", "config": {"stateful": false, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "unroll": false, "recurrent_constraint": null, "return_sequences": true, "recurrent_dropout": 0.15456897720561882, "go_backwards": false, "trainable": true, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0013548252172768116, "l1": 0.008457072079181671}}, "dropout": 0.052472621383912926, "implementation": 2, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}}, "use_bias": true, "name": "lstm_2", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 439, "unit_forget_bias": true, "dtype": null, "activation": "tanh"}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_3", "dtype": null, "stddev": 0.6371846347427901, "trainable": true}}, {"class_name": "GRU", "config": {"stateful": false, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "unroll": false, "recurrent_constraint": null, "return_sequences": true, "recurrent_dropout": 0.154115493505869, "go_backwards": false, "trainable": true, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.002823153045028448, "l1": 0.008363972418010235}}, "dropout": 0.15935515397884142, "implementation": 2, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}}, "use_bias": true, "name": "gru_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "reset_after": false, "units": 459, "dtype": null, "activation": "tanh"}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_4", "dtype": null, "stddev": 0.5040668290377035, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [2], "epsilon": 0.001, "name": "batch_normalization_2", "beta_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "dtype": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "layer": {"class_name": "LSTM", "config": {"stateful": false, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "unroll": false, "recurrent_constraint": null, "return_sequences": false, "recurrent_dropout": 0.11043636747194727, "go_backwards": false, "trainable": true, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.002823153045028448, "l1": 0.008363972418010235}}, "dropout": 0.13341007409152866, "implementation": 2, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}}, "use_bias": true, "name": "lstm_3", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 78, "unit_forget_bias": true, "dtype": null, "activation": "tanh"}}, "dtype": null, "merge_mode": "concat", "trainable": true}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_5", "dtype": null, "stddev": 0.580935046305535, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [1], "epsilon": 0.001, "name": "batch_normalization_3", "beta_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "gamma_regularizer": null, "scale": true, "dtype": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 16, "trainable": true, "activity_regularizer": null, "dtype": null, "activation": "linear"}}]}, "keras_version": "2.1.6-tf"}