{"config": {"build_input_shape": [null, 1, 105], "name": "sequential_1", "layers": [{"config": {"recurrent_regularizer": null, "recurrent_dropout": 0.2061423502975228, "go_backwards": false, "unroll": false, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "dtype": "float32", "stddev": 0.05}, "class_name": "TruncatedNormal"}, "name": "simple_rnn_2", "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_state": false, "units": 201, "return_sequences": true, "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "stateful": false, "time_major": false, "kernel_regularizer": null, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "activity_regularizer": null, "dropout": 0.11309564974181556}, "class_name": "SimpleRNN"}, {"config": {"trainable": true, "name": "gaussian_noise_1", "dtype": "float32", "stddev": 0.29075832540640334}, "class_name": "GaussianNoise"}, {"config": {"epsilon": 0.001, "dtype": "float32", "trainable": true, "axis": [2], "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "center": true, "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"recurrent_regularizer": null, "recurrent_dropout": 0.1358715028788712, "go_backwards": false, "implementation": 2, "unroll": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_in", "dtype": "float32"}, "class_name": "VarianceScaling"}, "name": "gru_1", "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_state": false, "units": 120, "return_sequences": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "stateful": false, "time_major": false, "kernel_regularizer": {"config": {"l1": 0.0001696571271168068, "l2": 0.0032820820342749357}, "class_name": "L1L2"}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "reset_after": false, "recurrent_constraint": null, "activity_regularizer": null, "dropout": 0.06268732638295568}, "class_name": "GRU"}, {"config": {"recurrent_regularizer": null, "recurrent_dropout": 0.09337150764352688, "go_backwards": false, "unroll": false, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "dtype": "float32", "stddev": 0.05}, "class_name": "RandomNormal"}, "name": "simple_rnn_3", "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_state": false, "units": 360, "return_sequences": false, "bias_regularizer": {"config": {"l1": 0.003354104468598962, "l2": 0.002158588031306863}, "class_name": "L1L2"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "stateful": false, "time_major": false, "kernel_regularizer": {"config": {"l1": 0.0001696571271168068, "l2": 0.0032820820342749357}, "class_name": "L1L2"}, "kernel_constraint": null, "activation": "tanh", "recurrent_constraint": null, "activity_regularizer": null, "dropout": 0.20328839851547573}, "class_name": "SimpleRNN"}, {"config": {"epsilon": 0.001, "dtype": "float32", "trainable": true, "axis": [1], "beta_regularizer": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "center": true, "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "units": 46, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}