{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": null, "layer": {"class_name": "LSTM", "config": {"kernel_constraint": null, "activation": "tanh", "return_state": false, "unroll": false, "recurrent_regularizer": null, "return_sequences": true, "dtype": null, "recurrent_constraint": null, "activity_regularizer": null, "dropout": 0.016679254774681143, "bias_constraint": null, "bias_regularizer": null, "go_backwards": false, "units": 463, "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"dtype": "float32", "minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "name": "lstm_1", "trainable": true, "implementation": 2, "unit_forget_bias": true, "stateful": false, "recurrent_dropout": 0.054340404352007265, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid"}}, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_2", "trainable": true, "dtype": null, "stddev": 0.15945273585369915}}, {"class_name": "SimpleRNN", "config": {"kernel_constraint": null, "activation": "tanh", "return_state": false, "unroll": false, "recurrent_constraint": null, "recurrent_regularizer": null, "return_sequences": true, "dtype": null, "recurrent_dropout": 0.17366845632186614, "activity_regularizer": null, "dropout": 0.19382044767845935, "bias_constraint": null, "bias_regularizer": null, "go_backwards": false, "units": 147, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_in"}}, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "name": "simple_rnn_2", "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_3", "trainable": true, "dtype": null, "stddev": 0.11568377223960749}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": null, "layer": {"class_name": "SimpleRNN", "config": {"kernel_constraint": null, "activation": "tanh", "return_state": false, "unroll": false, "recurrent_constraint": null, "recurrent_regularizer": null, "return_sequences": false, "dtype": null, "recurrent_dropout": 0.15740487056427702, "activity_regularizer": null, "dropout": 0.1552690102273846, "bias_constraint": null, "bias_regularizer": null, "go_backwards": false, "units": 366, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "distribution": "truncated_normal", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "name": "simple_rnn_3", "stateful": false, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, "merge_mode": "concat"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "gamma_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [1], "beta_regularizer": null, "dtype": null, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99, "scale": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "activation": "linear", "units": 1, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "dtype": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense_1"}}], "build_input_shape": [null, 1, 60]}, "backend": "tensorflow", "keras_version": "2.1.6-tf"}