{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "GRU", "config": {"unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.15655817316823686, "dropout": 0.057998988833118215, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_regularizer": null, "stateful": false, "recurrent_regularizer": null, "implementation": 2, "reset_after": false, "units": 134, "name": "gru_2", "recurrent_constraint": null, "return_state": false, "activation": "tanh", "dtype": null, "return_sequences": true, "bias_constraint": null, "go_backwards": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "truncated_normal", "mode": "fan_avg", "dtype": "float32"}}}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "LSTM", "config": {"unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.16296157408724327, "dropout": 0.20973359385447135, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_regularizer": null, "stateful": false, "recurrent_regularizer": null, "implementation": 2, "units": 164, "name": "lstm_1", "recurrent_constraint": null, "return_state": false, "activation": "tanh", "dtype": null, "return_sequences": true, "bias_constraint": null, "go_backwards": false, "kernel_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, "dtype": null, "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.43158157441811285, "name": "gaussian_noise_2", "trainable": true, "dtype": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_2", "scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "dtype": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_constraint": null, "axis": [2]}}, {"class_name": "GRU", "config": {"unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.04570837025844102, "dropout": 0.22007523829767506, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_regularizer": null, "stateful": false, "recurrent_regularizer": null, "implementation": 2, "reset_after": false, "units": 431, "name": "gru_3", "recurrent_constraint": null, "return_state": false, "activation": "tanh", "dtype": null, "return_sequences": false, "bias_constraint": null, "go_backwards": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_in", "dtype": "float32"}}}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.43252009297171784, "name": "gaussian_noise_3", "trainable": true, "dtype": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "beta_constraint": null, "name": "batch_normalization_3", "scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "dtype": null, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "gamma_constraint": null, "axis": [1]}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "bias_regularizer": null, "dtype": null, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}}}}], "name": "sequential_1", "build_input_shape": [null, 1, 60]}, "keras_version": "2.1.6-tf"}