{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Bidirectional", "config": {"dtype": "float32", "batch_input_shape": [null, 1, 97], "name": "bidirectional_4", "trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"dtype": "float32", "activation": "tanh", "implementation": 2, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "trainable": true, "dropout": 0.10000360949457782, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "units": 347, "recurrent_dropout": 0.24750901834937272, "return_state": false, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "lstm_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "stateful": false, "return_sequences": true, "unroll": false, "go_backwards": false}}}}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "merge_mode": "concat", "name": "bidirectional_5", "layer": {"class_name": "LSTM", "config": {"dtype": "float32", "activation": "tanh", "implementation": 2, "activity_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0034106087405234575, "l2": 0.004147103056311607}}, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "trainable": true, "dropout": 0.14350443431832932, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "units": 473, "recurrent_dropout": 0.2243382434930184, "return_state": false, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "lstm_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "stateful": false, "return_sequences": true, "unroll": false, "go_backwards": false}}, "trainable": true}}, {"class_name": "Bidirectional", "config": {"dtype": "float32", "merge_mode": "concat", "name": "bidirectional_6", "layer": {"class_name": "LSTM", "config": {"dtype": "float32", "activation": "tanh", "implementation": 2, "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0032915628980845213, "l2": 0.0011260980973020196}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0034106087405234575, "l2": 0.004147103056311607}}, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "trainable": true, "dropout": 0.11652010042586625, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "units": 124, "recurrent_dropout": 0.08412209218240756, "return_state": false, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "lstm_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "stateful": false, "return_sequences": false, "unroll": false, "go_backwards": false}}, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "momentum": 0.99, "axis": [1], "scale": true, "name": "batch_normalization_2", "center": true, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "config": {"dtype": "float32", "activation": "linear", "trainable": true, "use_bias": true, "units": 46, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "keras_version": "2.1.5-tf"}