{"class_name": "Sequential", "backend": "tensorflow", "config": {"build_input_shape": [null, 1, 105], "layers": [{"class_name": "GRU", "config": {"kernel_constraint": null, "return_state": false, "go_backwards": false, "stateful": false, "bias_regularizer": null, "recurrent_dropout": 0.10227239476977827, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dropout": 0.15803299722241423, "implementation": 2, "recurrent_constraint": null, "recurrent_regularizer": null, "dtype": null, "return_sequences": true, "name": "gru_3", "units": 354, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "reset_after": false, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05, "dtype": "float32"}}, "use_bias": true, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.19540153341215524, "dtype": null, "trainable": true, "name": "gaussian_noise_3"}}, {"class_name": "GRU", "config": {"kernel_constraint": null, "return_state": false, "go_backwards": false, "stateful": false, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.006115005351603031, "l2": 0.0041055455803871155}}, "recurrent_dropout": 0.0980977306039907, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dropout": 0.25, "implementation": 2, "recurrent_constraint": null, "recurrent_regularizer": null, "dtype": null, "return_sequences": true, "name": "gru_4", "units": 346, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "reset_after": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "truncated_normal"}}, "use_bias": true, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.2367652859768708, "dtype": null, "trainable": true, "name": "gaussian_noise_4"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "name": "batch_normalization_1", "center": true, "axis": [2], "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null}}, {"class_name": "GRU", "config": {"kernel_constraint": null, "return_state": false, "go_backwards": false, "stateful": false, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.006115005351603031, "l2": 0.0041055455803871155}}, "recurrent_dropout": 0.034630964992571796, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "dropout": 0.02300504540828814, "implementation": 2, "recurrent_constraint": null, "recurrent_regularizer": null, "dtype": null, "return_sequences": false, "name": "gru_5", "units": 414, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "reset_after": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "dtype": "float32", "mode": "fan_in", "distribution": "uniform"}}, "use_bias": true, "unroll": false, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.3437068057470981, "dtype": null, "trainable": true, "name": "gaussian_noise_5"}}, {"class_name": "Dense", "config": {"units": 46, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear"}}], "name": "sequential_1"}, "keras_version": "2.1.6-tf"}