{"config": {"layers": [{"config": {"layer": {"config": {"bias_regularizer": null, "unroll": false, "units": 498, "return_state": false, "kernel_constraint": null, "recurrent_constraint": null, "stateful": false, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.16022907294663785, "activity_regularizer": null, "activation": "tanh", "dropout": 0.08483929056318762, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": true, "recurrent_regularizer": null, "implementation": 2, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": null, "use_bias": true, "unit_forget_bias": true, "go_backwards": false, "bias_constraint": null, "name": "lstm_3", "kernel_regularizer": null}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat", "batch_input_shape": [null, 1, 67], "name": "bidirectional_3", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"stddev": 0.791759940271242, "trainable": true, "name": "gaussian_noise_2", "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_2", "trainable": true, "momentum": 0.99, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": [2], "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"layer": {"config": {"bias_regularizer": null, "unroll": false, "units": 489, "return_state": false, "kernel_constraint": null, "recurrent_constraint": null, "stateful": false, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.12796533289188888, "activity_regularizer": null, "activation": "tanh", "dropout": 0.06499849452772043, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": true, "recurrent_regularizer": null, "implementation": 2, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": null, "use_bias": true, "unit_forget_bias": true, "go_backwards": false, "bias_constraint": null, "name": "lstm_4", "kernel_regularizer": null}, "class_name": "LSTM"}, "trainable": true, "dtype": "float32", "name": "bidirectional_4", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_3", "trainable": true, "momentum": 0.99, "dtype": "float32", "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": [2], "beta_constraint": null, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"layer": {"config": {"bias_regularizer": null, "unroll": false, "units": 230, "return_state": false, "kernel_constraint": null, "recurrent_constraint": null, "stateful": false, "trainable": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.15270274615733137, "activity_regularizer": {"config": {"l1": 0.005057167261838913, "l2": 0.009160129353404045}, "class_name": "L1L2"}, "activation": "tanh", "dropout": 0.060696690066434834, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": false, "recurrent_regularizer": null, "implementation": 2, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": null, "use_bias": true, "unit_forget_bias": true, "go_backwards": false, "bias_constraint": null, "name": "lstm_5", "kernel_regularizer": null}, "class_name": "LSTM"}, "trainable": true, "dtype": "float32", "name": "bidirectional_5", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"stddev": 0.9487607165658665, "trainable": true, "name": "gaussian_noise_3", "dtype": "float32"}, "class_name": "GaussianNoise"}, {"config": {"activation": "linear", "bias_regularizer": null, "use_bias": true, "units": 16, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf"}