{"keras_version": "2.1.6-tf", "config": [{"class_name": "Bidirectional", "config": {"trainable": true, "merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.10895021520031103, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "units": 263, "stateful": false, "recurrent_regularizer": null, "trainable": true, "bias_constraint": null, "implementation": 2, "unroll": false, "name": "lstm_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}}, "return_state": false, "activation": "tanh", "return_sequences": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009944743476808071, "l1": 8.749101834837347e-05}}, "kernel_constraint": null, "dropout": 0.17140881762720664, "use_bias": true}}, "name": "bidirectional_3", "dtype": "float32", "batch_input_shape": [null, 1, 67]}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.009999999999999981, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "units": 512, "stateful": false, "recurrent_regularizer": null, "trainable": true, "bias_constraint": null, "implementation": 2, "unroll": false, "name": "lstm_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}}, "return_state": false, "activation": "tanh", "return_sequences": true, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009944743476808071, "l1": 8.749101834837347e-05}}, "kernel_constraint": null, "dropout": 0.1355104705105608, "use_bias": true}}, "merge_mode": "concat", "name": "bidirectional_4", "dtype": "float32", "trainable": true}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.010000000000000009, "name": "gaussian_noise_1", "dtype": "float32", "trainable": true}}, {"class_name": "Bidirectional", "config": {"layer": {"class_name": "LSTM", "config": {"kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.1326722070483092, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "units": 351, "stateful": false, "recurrent_regularizer": null, "trainable": true, "bias_constraint": null, "implementation": 2, "unroll": false, "name": "lstm_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}}, "return_state": false, "activation": "tanh", "return_sequences": false, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009944743476808071, "l1": 8.749101834837347e-05}}, "kernel_constraint": null, "dropout": 0.05293248828464191, "use_bias": true}}, "merge_mode": "concat", "name": "bidirectional_5", "dtype": "float32", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "axis": [1], "gamma_constraint": null, "scale": true, "dtype": "float32", "center": true, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "name": "batch_normalization_1", "beta_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32", "mode": "fan_avg"}}, "dtype": "float32", "activation": "linear", "units": 16, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true}}], "class_name": "Sequential", "backend": "tensorflow"}