{"keras_version": "2.4.0", "class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "ragged": false, "sparse": false, "batch_input_shape": [null, 1, 60], "name": "gru_1_input"}}, {"class_name": "GRU", "config": {"stateful": false, "dropout": 0.12519522602840022, "bias_regularizer": null, "reset_after": true, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "return_sequences": true, "trainable": true, "time_major": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "recurrent_dropout": 0.035227030222189454, "name": "gru_1", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "recurrent_activation": "sigmoid", "units": 344, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "unroll": false, "implementation": 1, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GaussianNoise", "config": {"dtype": "float32", "trainable": true, "stddev": 0.34829285815508215, "name": "gaussian_noise_2"}}, {"class_name": "BatchNormalization", "config": {"dtype": "float32", "momentum": 0.99, "beta_regularizer": null, "center": true, "epsilon": 0.001, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "axis": [2], "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_1"}}, {"class_name": "SimpleRNN", "config": {"stateful": false, "dropout": 0.11695257859406871, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "return_sequences": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "time_major": false, "trainable": true, "recurrent_dropout": 0.017096677745901397, "name": "simple_rnn_2", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "units": 108, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "unroll": false, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "GaussianNoise", "config": {"dtype": "float32", "trainable": true, "stddev": 0.36694750000050935, "name": "gaussian_noise_3"}}, {"class_name": "SimpleRNN", "config": {"stateful": false, "dropout": 0.16998389704186448, "bias_regularizer": null, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "return_sequences": false, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": null, "stddev": 0.05, "mean": 0.0}}, "time_major": false, "trainable": true, "recurrent_dropout": 0.10777680055029766, "name": "simple_rnn_3", "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "activation": "tanh", "units": 196, "recurrent_regularizer": null, "return_state": false, "kernel_constraint": null, "unroll": false, "go_backwards": false, "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"dtype": "float32", "use_bias": true, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "units": 1, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1"}}], "name": "sequential_1"}, "backend": "tensorflow"}