{"class_name": "Sequential", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "dropout": 0.06542853949625482, "bias_constraint": null, "units": 274, "name": "gru_3", "go_backwards": false, "kernel_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": null, "implementation": 2, "reset_after": false, "recurrent_dropout": 0.11377601914179042, "return_sequences": true, "bias_regularizer": null, "dtype": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "dtype": "float32", "minval": -0.05}}, "unroll": false, "stateful": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "epsilon": 0.001, "dtype": null, "axis": [2], "center": true, "name": "batch_normalization_1", "gamma_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "momentum": 0.99}}, {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "dropout": 0.059542340715890346, "bias_constraint": null, "units": 326, "name": "gru_4", "go_backwards": false, "kernel_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.009445822797715664, "l2": 0.0008979899575933814}}, "implementation": 2, "reset_after": false, "recurrent_dropout": 0.22942407870851342, "return_sequences": true, "bias_regularizer": null, "dtype": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.05, "seed": null, "dtype": "float32", "mean": 0.0}}, "unroll": false, "stateful": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_2", "trainable": true, "dtype": null, "stddev": 0.15008172250675125}}, {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "dropout": 0.1956878999154255, "bias_constraint": null, "units": 483, "name": "gru_5", "go_backwards": false, "kernel_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "activity_regularizer": {"class_name": "L1L2", "config": {"l1": 0.009445822797715664, "l2": 0.0008979899575933814}}, "implementation": 2, "reset_after": false, "recurrent_dropout": 0.030924210855874712, "return_sequences": false, "bias_regularizer": null, "dtype": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 1.0, "dtype": "float32", "distribution": "uniform"}}, "unroll": false, "stateful": false, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_3", "trainable": true, "dtype": null, "stddev": 0.3748877031123749}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "dtype": null, "units": 46, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "dtype": "float32", "distribution": "uniform"}}, "use_bias": true, "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_constraint": null}}], "build_input_shape": [null, 1, 105]}}