{"backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Sequential", "config": {"name": "sequential_1", "build_input_shape": [null, 1, 105], "layers": [{"class_name": "GRU", "config": {"kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.06542853949625482, "recurrent_constraint": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "recurrent_regularizer": null, "trainable": true, "unroll": false, "use_bias": true, "recurrent_dropout": 0.11377601914179042, "return_state": false, "return_sequences": true, "go_backwards": false, "reset_after": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 274, "stateful": false, "name": "gru_3", "dtype": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_constraint": null, "axis": [2], "trainable": true, "momentum": 0.99, "center": true, "dtype": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_regularizer": null, "beta_constraint": null}}, {"class_name": "GRU", "config": {"kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.059542340715890346, "recurrent_constraint": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "recurrent_regularizer": null, "trainable": true, "unroll": false, "use_bias": true, "recurrent_dropout": 0.22942407870851342, "return_state": false, "return_sequences": true, "go_backwards": false, "reset_after": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 326, "stateful": false, "name": "gru_4", "dtype": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null, "dtype": "float32"}}, "bias_regularizer": null}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_2", "trainable": true, "stddev": 0.15008172250675125, "dtype": null}}, {"class_name": "GRU", "config": {"kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "dropout": 0.1956878999154255, "recurrent_constraint": null, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "recurrent_regularizer": null, "trainable": true, "unroll": false, "use_bias": true, "recurrent_dropout": 0.030924210855874712, "return_state": false, "return_sequences": false, "go_backwards": false, "reset_after": false, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 483, "stateful": false, "name": "gru_5", "dtype": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_in"}}, "bias_regularizer": null}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_3", "trainable": true, "stddev": 0.3748877031123749, "dtype": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "units": 46, "activation": "linear", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "dtype": "float32", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null}}]}}