{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "SimpleRNN", "config": {"name": "simple_rnn_3", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.004011166747659445, "l2": 0.0037536704912781715}}, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.24336923146929124, "recurrent_dropout": 0.1712712686198118}}, {"class_name": "SimpleRNN", "config": {"name": "simple_rnn_4", "trainable": true, "dtype": null, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 203, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.004011166747659445, "l2": 0.0037536704912781715}}, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.10202516956116574, "recurrent_dropout": 0.185766483552546}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_2", "trainable": true, "dtype": null, "stddev": 0.4246754754701276}}, {"class_name": "SimpleRNN", "config": {"name": "simple_rnn_5", "trainable": true, "dtype": null, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 301, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.004011166747659445, "l2": 0.0037536704912781715}}, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.12690175835768996, "recurrent_dropout": 0.22594262737882453}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_3", "trainable": true, "dtype": null, "stddev": 0.23191146506675664}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": null, "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 1, 75]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}