{"backend": "tensorflow", "config": [{"config": {"trainable": true, "name": "bidirectional_4", "layer": {"config": {"trainable": true, "kernel_regularizer": null, "implementation": 2, "recurrent_constraint": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "units": 160, "name": "lstm_4", "unroll": false, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "activation": "tanh", "stateful": false, "bias_constraint": null, "go_backwards": false, "dropout": 0.07305507181602257, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": true, "recurrent_dropout": 0.078353884534854, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}, "class_name": "LSTM"}, "merge_mode": "concat", "batch_input_shape": [null, 1, 97], "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "dtype": "float32", "merge_mode": "concat", "name": "bidirectional_5", "layer": {"config": {"trainable": true, "kernel_regularizer": null, "implementation": 2, "recurrent_constraint": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "units": 356, "name": "lstm_5", "unroll": false, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "activation": "tanh", "stateful": false, "bias_constraint": null, "go_backwards": false, "dropout": 0.10068975201991567, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": true, "recurrent_dropout": 0.04796567723566406, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "dtype": "float32", "merge_mode": "concat", "name": "bidirectional_6", "layer": {"config": {"trainable": true, "kernel_regularizer": null, "implementation": 2, "recurrent_constraint": null, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "units": 432, "name": "lstm_6", "unroll": false, "unit_forget_bias": true, "return_state": false, "activity_regularizer": null, "activation": "tanh", "stateful": false, "bias_constraint": null, "go_backwards": false, "dropout": 0.24212594960903353, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": false, "recurrent_dropout": 0.1873739740431803, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null}, "class_name": "LSTM"}}, "class_name": "Bidirectional"}, {"config": {"stddev": 0.20626826005960605, "trainable": true, "dtype": "float32", "name": "gaussian_noise_2"}, "class_name": "GaussianNoise"}, {"config": {"activity_regularizer": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "units": 46, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5-tf"}