{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"config": {"layer": {"config": {"dtype": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "bias_regularizer": null, "activation": "tanh", "stateful": false, "implementation": 2, "bias_constraint": null, "units": 187, "trainable": true, "recurrent_activation": "hard_sigmoid", "time_major": false, "recurrent_dropout": 0.15301579856582745, "zero_output_for_mask": true, "go_backwards": false, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"dtype": "float32", "stddev": 0.05, "mean": 0.0, "seed": null}, "class_name": "TruncatedNormal"}, "activity_regularizer": null, "return_sequences": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "dropout": 0.1093199884417923, "name": "lstm_3", "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat", "name": "bidirectional_3", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"dtype": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "bias_regularizer": null, "activation": "tanh", "stateful": false, "implementation": 2, "bias_constraint": null, "units": 92, "trainable": true, "recurrent_activation": "hard_sigmoid", "time_major": false, "recurrent_dropout": 0.12411067916947334, "zero_output_for_mask": true, "go_backwards": false, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"maxval": 0.05, "dtype": "float32", "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": {"config": {"l1": 0.009336213581264019, "l2": 0.008692026138305664}, "class_name": "L1L2"}, "return_sequences": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "dropout": 0.09069419960762136, "name": "lstm_4", "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat", "name": "bidirectional_4", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"center": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "axis": [2], "momentum": 0.99, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_v1_2", "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalizationV1"}, {"config": {"layer": {"config": {"dtype": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "unit_forget_bias": true, "bias_regularizer": null, "activation": "tanh", "stateful": false, "implementation": 2, "bias_constraint": null, "units": 501, "trainable": true, "recurrent_activation": "hard_sigmoid", "time_major": false, "recurrent_dropout": 0.17346330271987614, "zero_output_for_mask": true, "go_backwards": false, "unroll": false, "recurrent_regularizer": null, "kernel_initializer": {"config": {"maxval": 0.05, "dtype": "float32", "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "activity_regularizer": {"config": {"l1": 0.009336213581264019, "l2": 0.008692026138305664}, "class_name": "L1L2"}, "return_sequences": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "dropout": 0.19514062931933254, "name": "lstm_5", "recurrent_constraint": null}, "class_name": "LSTM"}, "trainable": true, "merge_mode": "concat", "name": "bidirectional_5", "dtype": "float32"}, "class_name": "Bidirectional"}, {"config": {"center": true, "dtype": "float32", "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "beta_regularizer": null, "axis": [1], "momentum": 0.99, "scale": true, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_v1_3", "beta_constraint": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalizationV1"}, {"config": {"dtype": "float32", "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "linear", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 16, "trainable": true, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1", "build_input_shape": [null, 1, 75]}, "class_name": "Sequential"}