{"config": {"layers": [{"config": {"bias_constraint": null, "name": "simple_rnn_2", "kernel_constraint": null, "dropout": 0.16718729090172899, "return_state": false, "stateful": false, "use_bias": true, "go_backwards": false, "units": 257, "dtype": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}, "class_name": "RandomNormal"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": true, "bias_regularizer": null, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "recurrent_dropout": 0.13085622012425044}, "class_name": "SimpleRNN"}, {"config": {"dtype": null, "trainable": true, "name": "gaussian_noise_2", "stddev": 0.2666188392862036}, "class_name": "GaussianNoise"}, {"config": {"dtype": null, "layer": {"config": {"recurrent_activation": "hard_sigmoid", "bias_constraint": null, "name": "gru_1", "kernel_constraint": null, "dropout": 0.1572744260480736, "return_state": false, "stateful": false, "use_bias": true, "implementation": 2, "go_backwards": false, "units": 344, "dtype": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "truncated_normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": true, "bias_regularizer": null, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "reset_after": false, "recurrent_dropout": 0.043818024996167354}, "class_name": "GRU"}, "merge_mode": "concat", "name": "bidirectional_1", "trainable": true}, "class_name": "Bidirectional"}, {"config": {"bias_constraint": null, "name": "simple_rnn_3", "kernel_constraint": null, "dropout": 0.09270455852133885, "return_state": false, "stateful": false, "use_bias": true, "go_backwards": false, "units": 417, "dtype": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "dtype": "float32", "scale": 2.0, "distribution": "truncated_normal", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null, "dtype": "float32"}, "class_name": "Orthogonal"}, "return_sequences": false, "bias_regularizer": null, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "recurrent_dropout": 0.22883076185720705}, "class_name": "SimpleRNN"}, {"config": {"dtype": null, "trainable": true, "name": "gaussian_noise_3", "stddev": 0.1944626859891683}, "class_name": "GaussianNoise"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "epsilon": 0.001, "gamma_constraint": null, "beta_regularizer": null, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_1", "dtype": null, "axis": [1], "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "trainable": true, "center": true}, "class_name": "BatchNormalization"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "dtype": "float32", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "name": "dense_1", "units": 5, "dtype": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}], "build_input_shape": [null, 1, 49], "name": "sequential_1"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6-tf"}