{"keras_version": "2.4.0", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"name": "gru_1_input", "dtype": "float32", "batch_input_shape": [null, 1, 7], "ragged": false, "sparse": false}}, {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "trainable": true, "time_major": false, "go_backwards": false, "dtype": "float32", "bias_regularizer": null, "recurrent_dropout": 0.07287920084692194, "recurrent_activation": "sigmoid", "dropout": 0.012289788503771791, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "name": "gru_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "units": 107, "implementation": 1, "bias_constraint": null, "stateful": false, "activation": "tanh", "return_sequences": true, "reset_after": true, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "SimpleRNN", "config": {"kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "trainable": true, "go_backwards": false, "dtype": "float32", "bias_regularizer": null, "recurrent_dropout": 0.09632860245464947, "time_major": false, "dropout": 0.12433274717362253, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "recurrent_constraint": null, "name": "simple_rnn_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_state": false, "units": 104, "bias_constraint": null, "stateful": false, "activation": "tanh", "return_sequences": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.3859676395561914, "name": "gaussian_noise_1", "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "time_major": false, "go_backwards": false, "dtype": "float32", "bias_regularizer": null, "recurrent_dropout": 0.17161472544541695, "recurrent_activation": "sigmoid", "dropout": 0.24923586744227072, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "unit_forget_bias": true, "name": "lstm_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 106, "implementation": 1, "unroll": false, "bias_constraint": null, "stateful": false, "activation": "tanh", "return_sequences": false, "kernel_regularizer": null, "recurrent_constraint": null, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "units": 1, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}}]}, "backend": "tensorflow"}