{"keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "SimpleRNN", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "dtype": "float32", "mode": "fan_in", "seed": null, "scale": 2.0}}, "units": 388, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "return_state": false, "go_backwards": false, "recurrent_constraint": null, "name": "simple_rnn_3", "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "use_bias": true, "kernel_constraint": null, "stateful": false, "dropout": 0.0672112240569243, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "recurrent_dropout": 0.1414355551720989, "time_major": false}}, {"class_name": "SimpleRNN", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "truncated_normal", "dtype": "float32", "mode": "fan_in", "seed": null, "scale": 1.0}}, "units": 173, "bias_regularizer": null, "unroll": false, "return_sequences": true, "recurrent_regularizer": null, "return_state": false, "go_backwards": false, "recurrent_constraint": null, "name": "simple_rnn_4", "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "use_bias": true, "kernel_constraint": null, "stateful": false, "dropout": 0.06397997073336693, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "recurrent_dropout": 0.10474446347240417, "time_major": false}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.3762700520113501, "dtype": "float32", "trainable": true, "name": "gaussian_noise_2"}}, {"class_name": "SimpleRNN", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.05, "dtype": "float32", "seed": null, "mean": 0.0}}, "units": 190, "bias_regularizer": null, "unroll": false, "return_sequences": false, "recurrent_regularizer": null, "return_state": false, "go_backwards": false, "recurrent_constraint": null, "name": "simple_rnn_5", "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}, "use_bias": true, "kernel_constraint": null, "stateful": false, "dropout": 0.09096888292803032, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "recurrent_dropout": 0.08530020754567481, "time_major": false}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.4257789622646805, "dtype": "float32", "trainable": true, "name": "gaussian_noise_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "units": 16, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_constraint": null, "activation": "linear", "name": "dense_1"}}], "name": "sequential_1", "build_input_shape": [null, 1, 75]}, "backend": "tensorflow", "class_name": "Sequential"}