{"backend": "tensorflow", "keras_version": "2.1.6-tf", "config": {"name": "sequential_1", "build_input_shape": [null, 1, 75], "layers": [{"config": {"name": "bidirectional_3", "dtype": null, "merge_mode": "concat", "trainable": true, "layer": {"config": {"name": "gru_3", "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.15139704530819917, "recurrent_initializer": {"config": {"dtype": "float32", "seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "trainable": true, "stateful": false, "unroll": false, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "TruncatedNormal"}, "recurrent_activation": "hard_sigmoid", "units": 419, "activation": "tanh", "use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "implementation": 2, "activity_regularizer": null, "bias_regularizer": null, "dtype": null, "kernel_regularizer": null, "kernel_constraint": null, "dropout": 0.2418540116536091, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "reset_after": false}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"name": "gaussian_noise_2", "dtype": null, "trainable": true, "stddev": 0.5099609736571256}, "class_name": "GaussianNoise"}, {"config": {"name": "bidirectional_4", "dtype": null, "merge_mode": "concat", "trainable": true, "layer": {"config": {"name": "gru_4", "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0801752247599841, "recurrent_initializer": {"config": {"dtype": "float32", "seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "trainable": true, "stateful": false, "unroll": false, "kernel_initializer": {"config": {"distribution": "truncated_normal", "scale": 1.0, "seed": null, "mode": "fan_in", "dtype": "float32"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "units": 118, "activation": "tanh", "use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "implementation": 2, "activity_regularizer": null, "bias_regularizer": null, "dtype": null, "kernel_regularizer": null, "kernel_constraint": null, "dropout": 0.030849683293573966, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "reset_after": false}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"name": "bidirectional_5", "dtype": null, "merge_mode": "concat", "trainable": true, "layer": {"config": {"name": "gru_5", "bias_constraint": null, "go_backwards": false, "recurrent_dropout": 0.13900944353249786, "recurrent_initializer": {"config": {"dtype": "float32", "seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": false, "trainable": true, "stateful": false, "unroll": false, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}, "class_name": "TruncatedNormal"}, "recurrent_activation": "hard_sigmoid", "units": 170, "activation": "tanh", "use_bias": true, "recurrent_regularizer": null, "recurrent_constraint": null, "return_state": false, "implementation": 2, "activity_regularizer": {"config": {"l2": 0.0008121494902297854, "l1": 0.0033619652967900038}, "class_name": "L1L2"}, "bias_regularizer": null, "dtype": null, "kernel_regularizer": null, "kernel_constraint": null, "dropout": 0.12718462903599273, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "reset_after": false}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"name": "gaussian_noise_3", "dtype": null, "trainable": true, "stddev": 0.4097316922729161}, "class_name": "GaussianNoise"}, {"config": {"name": "dense_1", "bias_constraint": null, "activation": "linear", "use_bias": true, "units": 16, "trainable": true, "bias_regularizer": null, "dtype": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg", "dtype": "float32"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}