{"backend": "tensorflow", "class_name": "Sequential", "config": {"build_input_shape": [null, 1, 105], "name": "sequential_1", "layers": [{"class_name": "Bidirectional", "config": {"dtype": null, "layer": {"class_name": "GRU", "config": {"return_sequences": true, "units": 472, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "recurrent_dropout": 0.05135011737927528, "return_state": false, "kernel_constraint": null, "bias_regularizer": null, "reset_after": false, "bias_constraint": null, "activity_regularizer": null, "name": "gru_3", "activation": "tanh", "stateful": false, "go_backwards": false, "unroll": false, "kernel_regularizer": null, "dropout": 0.08560024160095653, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "implementation": 2, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, "trainable": true, "name": "bidirectional_3", "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"dtype": null, "stddev": 0.35942445763502906, "trainable": true, "name": "gaussian_noise_3"}}, {"class_name": "Bidirectional", "config": {"dtype": null, "layer": {"class_name": "GRU", "config": {"return_sequences": true, "units": 480, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "recurrent_dropout": 0.04562240735830358, "return_state": false, "kernel_constraint": null, "bias_regularizer": null, "reset_after": false, "bias_constraint": null, "activity_regularizer": null, "name": "gru_4", "activation": "tanh", "stateful": false, "go_backwards": false, "unroll": false, "kernel_regularizer": null, "dropout": 0.08734527313918128, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "implementation": 2, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "truncated_normal", "seed": null, "mode": "fan_in", "dtype": "float32"}}}}, "trainable": true, "name": "bidirectional_4", "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"dtype": null, "stddev": 0.45166244258566646, "trainable": true, "name": "gaussian_noise_4"}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [2], "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "momentum": 0.99, "dtype": null, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "trainable": true, "center": true}}, {"class_name": "Bidirectional", "config": {"dtype": null, "layer": {"class_name": "GRU", "config": {"return_sequences": false, "units": 268, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"dtype": "float32", "gain": 1.0, "seed": null}}, "recurrent_dropout": 0.07004095856710293, "return_state": false, "kernel_constraint": null, "bias_regularizer": null, "reset_after": false, "bias_constraint": null, "activity_regularizer": null, "name": "gru_5", "activation": "tanh", "stateful": false, "go_backwards": false, "unroll": false, "kernel_regularizer": null, "dropout": 0.18954096493680037, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "implementation": 2, "recurrent_regularizer": null, "use_bias": true, "recurrent_constraint": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "truncated_normal", "seed": null, "mode": "fan_avg", "dtype": "float32"}}}}, "trainable": true, "name": "bidirectional_5", "merge_mode": "concat"}}, {"class_name": "GaussianNoise", "config": {"dtype": null, "stddev": 0.21525237939487024, "trainable": true, "name": "gaussian_noise_5"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 46, "name": "dense_1", "activation": "linear", "dtype": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32"}}}}]}, "keras_version": "2.1.6-tf"}