{"class_name": "Sequential", "config": {"build_input_shape": [null, 1, 105], "name": "sequential_1", "layers": [{"class_name": "GRU", "config": {"implementation": 2, "activity_regularizer": null, "recurrent_dropout": 0.21643328272585577, "reset_after": false, "stateful": false, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "dtype": "float32", "seed": null, "maxval": 0.05}}, "use_bias": true, "trainable": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "name": "gru_3", "recurrent_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "dtype": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "units": 154, "activation": "tanh", "go_backwards": false, "dropout": 0.09372570142200011, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}}}, {"class_name": "GaussianNoise", "config": {"dtype": null, "name": "gaussian_noise_1", "trainable": true, "stddev": 0.11941195067823518}}, {"class_name": "BatchNormalization", "config": {"axis": [2], "name": "batch_normalization_2", "beta_regularizer": null, "center": true, "dtype": null, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "GRU", "config": {"implementation": 2, "activity_regularizer": null, "recurrent_dropout": 0.209984230852159, "reset_after": false, "stateful": false, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "trainable": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "name": "gru_4", "recurrent_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "dtype": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "units": 342, "activation": "tanh", "go_backwards": false, "dropout": 0.13500530089567536, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"axis": [2], "name": "batch_normalization_3", "beta_regularizer": null, "center": true, "dtype": null, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "momentum": 0.99, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_constraint": null, "gamma_constraint": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "GRU", "config": {"implementation": 2, "activity_regularizer": null, "recurrent_dropout": 0.10608431902188988, "reset_after": false, "stateful": false, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "dtype": "float32", "distribution": "uniform", "seed": null, "scale": 2.0}}, "use_bias": true, "trainable": true, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "name": "gru_5", "recurrent_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "dtype": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "units": 192, "activation": "tanh", "go_backwards": false, "dropout": 0.18922228306261696, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "dtype": "float32", "seed": null}}}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "dtype": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "dtype": "float32", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "units": 46, "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_constraint": null}}]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}