{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.4.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"ragged": false, "name": "lstm_2_input", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 1, 7]}}, {"class_name": "LSTM", "config": {"return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "go_backwards": false, "units": 89, "activation": "tanh", "bias_constraint": null, "recurrent_regularizer": null, "return_state": false, "dropout": 0.10087618058153276, "recurrent_dropout": 0.0994839565873545, "use_bias": true, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0031715494114905596, "l1": 0.00430797366425395}}, "implementation": 1, "name": "lstm_2", "time_major": false, "recurrent_constraint": null, "unroll": false, "stateful": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "sigmoid", "unit_forget_bias": true, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": [2]}}, {"class_name": "SimpleRNN", "config": {"return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "bias_constraint": null, "recurrent_regularizer": null, "return_state": false, "dropout": 0.10314913050828572, "recurrent_dropout": 0.12167125267394568, "use_bias": true, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0031715494114905596, "l1": 0.00430797366425395}}, "name": "simple_rnn_1", "time_major": false, "recurrent_constraint": null, "stateful": false, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "trainable": true, "unroll": false, "units": 101}}, {"class_name": "GaussianNoise", "config": {"name": "gaussian_noise_1", "stddev": 0.11149919295952078, "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "go_backwards": false, "units": 81, "activation": "tanh", "bias_constraint": null, "recurrent_regularizer": null, "return_state": false, "dropout": 0.04743716802526747, "recurrent_dropout": 0.19982059034356206, "use_bias": true, "bias_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0031715494114905596, "l1": 0.00430797366425395}}, "implementation": 1, "name": "lstm_3", "time_major": false, "recurrent_constraint": null, "unroll": false, "stateful": false, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null}}, "recurrent_activation": "sigmoid", "unit_forget_bias": true, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"scale": true, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "center": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": [1]}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "bias_constraint": null, "units": 1, "use_bias": true}}], "name": "sequential_1"}}