{"class_name": "Sequential", "keras_version": "2.2.4-tf", "config": {"layers": [{"class_name": "SimpleRNN", "config": {"return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "unroll": false, "return_state": false, "stateful": false, "recurrent_dropout": 0.03285835846404139, "recurrent_constraint": null, "bias_regularizer": null, "time_major": false, "activation": "tanh", "name": "simple_rnn_2", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.05, "seed": null, "mean": 0.0, "dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 328, "dropout": 0.05267218844481646, "activity_regularizer": null, "go_backwards": false, "trainable": true}}, {"class_name": "SimpleRNN", "config": {"return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "unroll": false, "return_state": false, "stateful": false, "recurrent_dropout": 0.21532247621115938, "recurrent_constraint": null, "bias_regularizer": null, "time_major": false, "activation": "tanh", "name": "simple_rnn_3", "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null, "dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 205, "dropout": 0.14595116366778701, "activity_regularizer": null, "go_backwards": false, "trainable": true}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.20589391628391973, "trainable": true, "dtype": "float32", "name": "gaussian_noise_2"}}, {"class_name": "LSTM", "config": {"return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "dtype": "float32", "gain": 1.0}}, "unroll": false, "return_state": false, "stateful": false, "recurrent_dropout": 0.14841117457540032, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "time_major": false, "activation": "tanh", "name": "lstm_1", "unit_forget_bias": true, "kernel_initializer": {"class_name": "GlorotNormal", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "recurrent_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 259, "recurrent_constraint": null, "dropout": 0.15011149208271002, "activity_regularizer": null, "go_backwards": false, "implementation": 2, "trainable": true}}, {"class_name": "GaussianNoise", "config": {"stddev": 0.20537850656846773, "trainable": true, "dtype": "float32", "name": "gaussian_noise_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "use_bias": true, "units": 18, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_1"}}], "build_input_shape": [null, 1, 77], "name": "sequential_1"}, "backend": "tensorflow"}