{"config": {"name": "sequential_1", "layers": [{"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.11804661051453268, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "units": 371, "bias_constraint": null, "dropout": 0.13304148633999885, "return_sequences": true, "return_state": false, "dtype": "float32", "activation": "tanh", "implementation": 2, "time_major": false, "go_backwards": false, "reset_after": false, "use_bias": true, "unroll": false, "name": "gru_3", "bias_regularizer": null, "stateful": false}, "class_name": "GRU"}, {"config": {"name": "gaussian_noise_3", "dtype": "float32", "trainable": true, "stddev": 0.4281992465149586}, "class_name": "GaussianNoise"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_v1_2", "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": [2]}, "class_name": "BatchNormalizationV1"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.18919600048850183, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "units": 468, "bias_constraint": null, "dropout": 0.13561282875414837, "return_sequences": true, "return_state": false, "dtype": "float32", "activation": "tanh", "implementation": 2, "time_major": false, "go_backwards": false, "reset_after": false, "use_bias": true, "unroll": false, "name": "gru_4", "bias_regularizer": null, "stateful": false}, "class_name": "GRU"}, {"config": {"name": "gaussian_noise_4", "dtype": "float32", "trainable": true, "stddev": 0.21930542876765013}, "class_name": "GaussianNoise"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_dropout": 0.05035627606870388, "trainable": true, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "recurrent_initializer": {"config": {"dtype": "float32", "gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "units": 242, "bias_constraint": null, "dropout": 0.10582104511630813, "return_sequences": false, "return_state": false, "dtype": "float32", "activation": "tanh", "implementation": 2, "time_major": false, "go_backwards": false, "reset_after": false, "use_bias": true, "unroll": false, "name": "gru_5", "bias_regularizer": null, "stateful": false}, "class_name": "GRU"}, {"config": {"name": "gaussian_noise_5", "dtype": "float32", "trainable": true, "stddev": 0.7295641079724502}, "class_name": "GaussianNoise"}, {"config": {"gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "trainable": true, "name": "batch_normalization_v1_3", "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "momentum": 0.99, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "beta_regularizer": null, "axis": [1]}, "class_name": "BatchNormalizationV1"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "name": "dense_1", "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "units": 16}, "class_name": "Dense"}], "build_input_shape": [null, 1, 75]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4-tf"}